[
    {
        "id": 1,
        "query": "\"internet of things\" OR iot",
        "documents": [
            {
              "title": "Communication Protocol Stack for Constrained IoT Systems",
              "abstract": "Internet of Things (IoT) has gained huge popularity through its rapid advancements and wide applicability in real world applications that have transformed our lives. Communication plays an integral role in connecting IoT devices. For effective communication in IoT, the protocols that offer lightweight, secure and reliable communication without compromising the computational and energy limitations, of the employed constrained IoT devices are the need of hour. Literature reveals certain protocols such as CoAP, MQTT, XMPP, RESTFUL Services, 6LoWPAN, RPL etc, that can be deployed for carrying communication at different layers. This paper insight the various IoT protocols applied at different layers of IoT protocol suite and analyze the efficacy and reliability of these protocols on the basis of energy efficiency, security and lightweight nature of protocols.",
              "article_number": "8519904"
            },
            {
              "title": "Internet of Things Security - Multilayered Method For End to End Data Communications Over Cellular Networks",
              "abstract": "The aim of this paper is to put forth a multilayered method for securing data transport from a cellular connected Internet of Things device to a host through a cellular network. This method employs many interlocking security elements - described in this paper - that when implemented in their totality provide a highly secure connectivity solution.",
              "article_number": "8767227"
            },
            {
              "title": "Securing IoT Devices and SecurelyConnecting the Dots Using REST API and Middleware",
              "abstract": "Internet of Things (IoT) is a fairly disruptive technology with inconceivable growth, impact, and capability. We present the role of REST API in the IoT Systems and some initial concepts of IoT, whose technology is able to record and count everything. We as well highlight the concept of middleware that connects these devices and cloud. The appearance of new IoT applications in the cloud has brought new threats to security and privacy of data. Therefore it is required to introduce a secure IoT system which doesn't allow attackers infiltration in the network through IoT devices and also to secure data in transit from IoT devices to cloud. We provide the details on how Representational State Transfer (REST) API allows to securely expose connected devices to applications on cloud and users. In the proposed model, middleware is primarily used to expose device data through REST and to hide details and act as an interface to the user to interact with sensor data.",
              "article_number": "8777334"
            },
            {
              "title": "A study of distributed compressive sensing for the Internet of Things (IoT)",
              "abstract": "Compressive sensing (CS) has been very useful for the Internet of Things (IoT). CS aims to reduce the number of samples acquired and transmitted by a sensor node using a low complex sampling operation. Furthermore, distributed compressive sensing (DCS) was introduced where the compressively sampled sensors' readings are jointly recovered at the fusion center rather than being recovered separately as in the CS. As a result, a reduction in the number of required measurements as well as the complexity of the sensor nodes is achieved. None of the previous works had studied the performance of DCS for sensed signals with abnormalities caused by sensor malfunctioning, sudden changes in temperature, or humidity. (i.e., practical IoT networks). In this paper, we extensively study the performance of DCS when signals with abnormalities are considered using simulations. The results show that DCS outperforms CS in successfully recovering signals with abnormalities.",
              "article_number": "8355095"
            },
            {
              "title": "Identity/identifier-enabled networks (IDEAS) for Internet of Things (IoT)",
              "abstract": "Future Networks have proposed many Identifier/Locator Split (ILS) schemes in the past decade, and these ILS solutions are being recently considered for diverse IoT applications. Meanwhile, the split of identity and identifier should be of interest for IoT as well. However, nowadays there does not have any unified identify/identifier/locator split framework or system architecture, as a common control mechanism or plane for interoperation of heterogeneous identity/identifier-enabled networks. Thus, this unified framework is our current focus that is under development, while this paper will present some initial efforts from various aspects. Particularly, many identity/identifier-based value-added services will be briefly explored for customized usage in IoT applications. Overall, this paper aims to promote a common ID-based control plane for unifying identity-identifier-locator split in IoT environment.",
              "article_number": "8355102"
            },
            {
              "title": "IEEE Draft Guide to Assess the Electromagnetic Fields (EMF) Exposure of Internet of Things (IoT) Technologies/Solutions",
              "abstract": "In the wireless communication field, 5G and Internet of Things (IoT) solutions are the main emerging technologies and future wireless communication will rely on them. A methodology for classifying IoT devices based on radio frequency (RF) exposure characteristics is provided. Classification is based on frequency, bandwidth, radiated power, and typical installation configuration. Links between device class and available measurement/computational standards are provided. A framework criterion for exclusion classes for exposure assessment and criteria for addressing situations where exposure assessment is unavailable are included.",
              "article_number": "9151429"
            },
            {
              "title": "IEEE Draft Guide to Assess the Electromagnetic Fields (EMF) Exposure of Internet of Things (IoT) Technologies/Solutions",
              "abstract": "In the wireless communication field, 5G and Internet of Things (IoT) solutions are the main emerging technologies and future wireless communication will rely on them. A methodology for classifying IoT devices based on radio frequency (RF) exposure characteristics is provided. Classification is based on frequency, bandwidth, radiated power, and typical installation configuration. Links between device class and available measurement/computational standards are provided. A framework criterion for exclusion classes for exposure assessment and criteria for addressing situations where exposure assessment is unavailable are included.",
              "article_number": "9063722"
            },
            {
              "title": "Secure and trusted telemedicine in Internet of Things IoT",
              "abstract": "Internet of Things (IoT) is a revolutionary technology for the modern society. IoT can connect every surrounding objects for various applications like security, medical fields, monitoring and other industrial applications. This paper considers the application of IoT in the field of medicine. IoT in E-medicine can take the advantage of emerging technologies to provide immediate treatment to the patient as well as monitors and keeps track of health record for healthy person. IoT then performs complex computations on these collected data and can provide health related advice. Though IoT can provide a cost effective medical services to any people of all age groups, there are several key issues that need to be addressed. System security, IoT interoperability, dynamic storage facility and unified access mechanisms are some of the many fundamental issues associated with IoT. This paper proposes a system level design solution for security and flexibility aspect of IoT. In this paper, the functional components are bound in security function group which ensures the management of privacy and secure operation of the system. The security function group comprises of components which offers secure communication using Ciphertext-Policy Attribute-Based Encryption (CP-ABE). Since CP-ABE are delegated to unconstrained devices with the assumption that these devices are trusted, the producer encrypts data using AES and the ABE scheme is protected through symmetric key solutions.",
              "article_number": "8355206"
            },
            {
              "title": "A complete Internet of Things (IoT) platform for Structural Health Monitoring (SHM)",
              "abstract": "Structural Health Monitoring (SHM) is becoming a crucial research topic to improve the human safety and to reduce maintenance costs. However, most of the existing SHM systems face challenges performing at real-time due to environmental effects and different operational hazards. Furthermore, the remote and constant monitoring amenities are not established yet, properly. To overcome this, Internet of Things (IoT) can be used, which would provide flexibility to monitor structures (building, bridge) from anywhere. In this paper, a complete IoT SHM platform is proposed. The platform consists of a Raspberry Pi, an analog to digital converter (ADC) MCP3008, and a Wi-Fi module for wireless communication. Piezoelectric (PZT) sensors were used to collect the data from the structure. The MCP3008 is used as an interface between the PZT sensors and the Raspberry Pi. The raspberry pi performs the necessary calculations to determine the SHM status using a proposed mathematical model to determine the damage's location and size if any. The All the data is pushed to the Internet filter using ThingWorx platform. The proposed platform is evaluated and tested successfully.",
              "article_number": "8355094"
            },
            {
              "title": "Low Cost Energy Efficient Smart Security System with Information Stamping for IoT Networks",
              "abstract": "A security system with CCTV and other network nodes in IoT deals with large amount of data, so the need for devices with larger storage space comes into the picture which is a bit costlier. Traditional security systems are more power consuming as it has to record for 24x7 with more throughput but less efficient. Thus need human in middle to upload into cloud is needed. In this work, we propose a low-cost energy efficient smart security system for CCTV with other network nodes. Whenever motion is detected by passive infrared (PIR) sensor, at that time only the camera and all other security sensor nodes in network are activated (Switched on), the captured video and information (sensor data) are stamped on the image using image processing techniques on Python platform. It will be stored in a local storage device, after certain threshold (based on sensitivity of the location) data will be uploaded into the cloud along with data log created during processing stage by Python programming model. In this way, we can reduce the amount of data to be stored (as no recording when idle), consumed power (as device is switched off when idle), maintenance cost(as fully programmed). No need for human in middle for uploading data into the cloud (as program will upload data in to cloud). Because of time, date and information (data from sensor nodes) stamping on each frame of video using python programming model video access becomes easier, as data log will be created.",
              "article_number": "8519875"
            },
            {
              "title": "Taking the SIoT down from the cloud: Integrating the Social Internet of Things in the INPUT architecture",
              "abstract": "The Social Internet of Things (SIoT) is a paradigm which is rapidly gaining ground in the Internet of Things (IoT) domain. In the SIoT objects can establish social-like relationships between each others autonomously. In this paper a solution is presented that integrates the SIoT concept in the architecture proposed within the INPUT project. More specifically the feature is exploited of the INPUT project which allows for running the virtual representation of a smart/social object in the access router which is nearest to the physical object. In this way it is expected that delay will decrease and efficiency in the usage of network resources will increase.",
              "article_number": "7389023"
            },
            {
              "title": "Smart Energy Efficient Home Automation System Using IoT",
              "abstract": "Advancement in IoT based application has become the state-of-the art technology among the researcher due to the availability of Internet everywhere. To make the application more user friendly, web based and android based technologies have gained their importance in this cutting edge technology. In this paper, smart energy efficient home automation system is proposed that can access and control the home equipments from every corner of the world. For this system, Internet connectivity module is attached to the main supply unit of the home system which can be accessed through the Internet. For wireless connectivity, the static IP address is used. Home automation is based on multimodal application that can be operated using voice recognition command of the user using the Google Assistant or through a web based application. Thus, main objective of this work is to make our home automation system more secure and intelligent.",
              "article_number": "8777607"
            },
            {
              "title": "ELNIDS: Ensemble Learning based Network Intrusion Detection System for RPL based Internet of Things",
              "abstract": "Internet of Things is realized by a large number of heterogeneous smart devices which sense, collect and share data with each other over the internet in order to control the physical world. Due to open nature, global connectivity and resource constrained nature of smart devices and wireless networks the Internet of Things is susceptible to various routing attacks. In this paper, we purpose an architecture of Ensemble Learning based Network Intrusion Detection System named ELNIDS for detecting routing attacks against IPv6 Routing Protocol for Low-Power and Lossy Networks. We implement four different ensemble based machine learning classifiers including Boosted Trees, Bagged Trees, Subspace Discriminant and RUSBoosted Trees. To evaluate proposed intrusion detection model we have used RPL-NIDDS17 dataset which contains packet traces of Sinkhole, Blackhole, Sybil, Clone ID, Selective Forwarding, Hello Flooding and Local Repair attacks. Simulation results show the effectiveness of the proposed architecture. We observe that ensemble of Boosted Trees achieve the highest Accuracy of 94.5% while Subspace Discriminant method achieves the lowest Accuracy of 77.8 % among classifier validation methods. Similarly, an ensemble of RUSBoosted Trees achieves the highest Area under ROC value of 0.98 while lowest Area under ROC value of 0.87 is achieved by an ensemble of Subspace Discriminant among all classifier validation methods. All the implemented classifiers show acceptable performance results.",
              "article_number": "8777504"
            },
            {
              "title": "Energy-aware services composition for Internet of Things",
              "abstract": "Internet of Things (IoT) are going to change our daily live in the near future. As IoT services prevail, many edge server, gateways, sensors and actuators etc. will be widely available in cities and smart spaces. Thus, how do we exploit these resources to provide rich and green services to users has become a very critical issue. In the past, researchers have developed QoS-based service composition schemes for IoT. However, they fail to consider energy efficiency in service composition. This paper extended previous QoS-based scheme to consider power consumption when linking various objects in the IoT environment based on users' demand. Simulation results show that our algorithm performs efficiently regarding computation complexity and energy efficiency in comparison with existing QoS-based algorithms.",
              "article_number": "8355213"
            },
            {
              "title": "IEEE Draft Standard for Framework of Blockchain-based Internet of Things (IoT) Data Management",
              "abstract": "A framework of blockchain-based Internet of Things (IoT ) data management is defined in this standard. It identifies the common building blocks of the framework that blockchain enabled during IoT data lifecycle including data acquisition, processing, storage, analyzing, usage/exchange and obsoletion, and the interactions among these building blocks.",
              "article_number": "9190120"
            },
            {
              "title": "IEEE Draft Standard for Framework of Blockchain-based Internet of Things (IoT) Data Management",
              "abstract": "A framework of blockchain-based Internet of Things (IoT ) data management is defined in this standard. It identifies the common building blocks of the framework that blockchain enabled during IoT data lifecycle including data acquisition, processing, storage, analyzing, usage/exchange and obsoletion, and the interactions among these building blocks.",
              "article_number": "9144682"
            },
            {
              "title": "IEEE Approved Draft Standard for Framework of Blockchain-based Internet of Things (IoT) Data Management",
              "abstract": "A framework of blockchain-based Internet of Things (IoT ) data management is defined in this standard. It identifies the common building blocks of the framework that blockchain enabled during IoT data lifecycle including data acquisition, processing, storage, analyzing, usage/exchange and obsoletion, and the interactions among these building blocks.",
              "article_number": "9336374"
            },
            {
              "title": "Next Generation Lightweight Cryptography for Smart IoT Devices: : Implementation, Challenges and Applications",
              "abstract": "High/ultra-high speed data connections are currently being developed, and by the year 2020, it is expected that the 5th generation networking (5GN) should be much smarter. It would provide great quality of service (QoS) due to low latency, less implementation cost and high efficiency in data processing. These networks could be either a point-to-point (P2P) communication link or a point-to-multipoint (P2M) communication link, which, P2M is also known as multi-casting that addresses multiple subscribers. The P2M systems usually have diverse nodes (also called as `Things') according to services and levels of security required. These nodes need an uninterrupted network inter-connectivity as well as a cloud platform to manage data sharing and storage. However, the Internet of Things (IoT), with real-time applications like in smart cities, wearable gadgets, medical, military, connected driver-less cars, etc., includes massive data processing and transmission. Nevertheless, integrated circuits (ICs) deployed in IoT based infrastructures have strong constraints in terms of size, cost, power consumption and security. Concerning the last aspect, the main challenges identified so far are resilience of the deployed infrastructure, confidentiality, integrity of exchanged data, user privacy and authenticity. Therefore, well secured and effective cryptographic algorithms are needed that cause small hardware footprints, i.e. Lightweight Cryptography (LWC), also with the provision of robustness, long range transfer of encrypted data and acceptable level of security.In this paper, the implementation, challenges and futuristic applications of LWC algorithms for smart IoT devices have been discussed, especially the performance of Long-Range Wide Area Network (LoRaWAN) which is an open standard that defines the communication protocol for Low-Power Wide Area Network (LPWAN) technology.",
              "article_number": "8767250"
            },
            {
              "title": "Towards low-energy, low-cost and high-performance IoT-based operation of interconnected systems",
              "abstract": "The advent of new communication standards for the Internet of Things (IoT), such as Sigfox or NB-IoT, opens a new set of possibilities that enable low-power communication between a large number of devices. New challenges such as very low data-rates are associated to these new technologies. This work shows that the combination of limited low-power communications and low-cost microcontrollers does not necessarily mean that simple, suboptimal strategies should be used to operate the cyber-physical-systems on which IoT devices are installed such as smart buildings and smart cities. In particular, predictive approaches based on numerical optimization, efficiently implemented on low-cost microcontrollers, counteract some of the shortcomings of low-power communication technologies and can enable the full potential of the internet of things. We present how low-power, low-cost solutions running advanced control and operation algorithms could be deployed and show the advantages of the proposed idea using Sigfox communication and simulation results for the temperature control of a smart building.",
              "article_number": "8355111"
            },
            {
              "title": "The deployment of an IoT network infrastructure, as a localised regional service",
              "abstract": "The Internet of things (IoT) is fast evolving with a wide range of technologies being designated specifically as IoT solutions. Studies on such solutions generally reference the specific communication medium while negating the complete architecture of the IoT system. From a system perspective, a complete IoT solution can be separated into three categories, the data collector, the communication method and the cloud platform service. The data collector relates to the embedded system device (or the `things' element) at the source of the application, the communication method relates to the network protocol used to send or receive the data and the cloud platform service relates to the facility used to store and process the data collected. LoRaWan and LoRa are `Long Range' technologies, which define the communication method for such IoT applied systems. LoRa defines the modulation technique, that allows for long range communication, whereas LoRaWan defines the communication and system architecture.This paper presents the design architecture and methodology of a fully functioning LoRaWan based IoT system. Such a system can be provided as a service to a given local region, by utilizing an End Device in conjunction with a LoRa transceiver, a LoRaWan Gateway and a defined cloud platform. The presented IoT system currently serves the region of Tallaght (Dublin, Ireland) and its wider area. As a service, the system has been shown to be capable of supporting a wide range of IoT based applications.",
              "article_number": "8767188"
            },
            {
              "title": "An Experimental Evaluation of Energy Trade-Offs in Narrowband IoT",
              "abstract": "Narrowband IoT is introduced to support cellular Internet of Things. Several features introduced in NB-IoT help to reduce the energy consumption of an IoT node. While older energy models typically rely on theoretical assumptions, we present an experimental evaluation of the NB-IoT energy consumption. By controlling the link quality and measuring the energy consumption in each modem state, we are able to establish a fine-grained energy profile of a NB-IoT module in a public telecommunications network. In this paper, we compare a theoretical model found in literature with the results of this real-life setup. Our measurements indicate a less optimistic power profile than proposed in the theoretical model. We also highlight the contribution of each of the Narrowband IoT (NB-IoT) defined modem states to the typical energy profile of an NB-IoT node. This allows for a more realistic model for energy simulations and for further optimization of the power efficiency of NB-IoT applications.",
              "article_number": "9221010"
            },
            {
              "title": "Opportunistic cyberphysical services: A novel paradigm for the future Internet of Things",
              "abstract": "Services have a paramount importance for unfolding the potential of the future Internet of Things (IoT), a dense, open, cyberphysical ecosystem in which humans, conventional computing systems and daily objects straightforwardly interoperate. By summarizing our previous contributions in such novel research context, this paper promotes our vision of “Opportunistic IoT Services” and a full-fledged approach to their modeling according to their opportunistic properties. Its effectiveness and flexibility is illustrated by means of two case studies, related to the Industrial IoT and Smart City scenarios.",
              "article_number": "8355174"
            },
            {
              "title": "AssIUT IOT: A Remotely Accessible Testbed for Internet of Things",
              "abstract": "Internet of Thins is a paradigm in which things (devices) communicate with each other and with a cloud platform to perform a set of tasks includes monitoring and controlling the device or the surrounding environment. In this paper, we introduce the basic architecture of AssIUT IoT a remotely accessible testbed designed for IoT applications. The testbed adopts Experiment as a Service (EaaS) model as it provides a suitable and easy way to remotely implement experiments related to IoT applications. We provide details about the testbed design and architecture from hardware and software point of views. Also, we provide some examples of the experiments which can be implemented using our testbed.",
              "article_number": "8620157"
            },
            {
              "title": "5G Internet of Things (IOT) Near and Far-Fields and Regulatory Compliance Intricacies",
              "abstract": "Internet of things (IOT) primarily consists of an instrumentation system that connects to the internet. Most modern applications of IOT would be integrated with wireless connectivity. Billions of sensing devices will be integrated with million types of wireless devices operating at varying frequency bands, power levels, and time intervals. Both intentional and unintentional radiations from the circuits of device instrumentation system, the collocated devices, and the operating environments can be higher than the operating sensitivity level of the wireless receivers. This paper reviews testability challenges of 5G IOT devices integrated with mmW and low frequency wireless. It also provides some insight on mmW near-field and far-field measurement challenges, and the necessity of radiated immunity evaluation. Lastly, it describes the theory used to explain the observation that the actual near-field or far-field starting distance is smaller than the calculated distance based on the overall dimensions of the massive MIMO antenna system and discusses the supporting experimental data.",
              "article_number": "8767334"
            },
            {
              "title": "Energy-efficient Sensors in Data Centers for Industrial Internet of Things (IIoT)",
              "abstract": "The various works on the corresponding and the associated need for a wireless industrial sensor network connectivity, applicable in the Industrial Internet of things (IIoT) domain have been exhaustive quite recently. This study has also clearly shown how they are grouped differently to that which is required by the consumer industries, with much emphasis on energy consumption and control, throughput reliability, stability of the sensors and their embedded security characteristics. To accomplish a deserving Quality of Service (QoS) of IIoT to which is expected, the data centers must have a guaranteed performance as a backbone of computation resources. This paper implements and investigates energy efficient sensors in the computing resources of data center for Industrial Internet of Things (IIoT). The simulation works investigates the resulting throughput performance and energy consumption profiles and control of the sensor nodes with respect to the three-tier network architecture as one of candidate backbone in IIoT.",
              "article_number": "8519871"
            },
            {
              "title": "Energy Harvesting Meets IoT: Fuelling Adoption of Transient Computing in Embedded Systems",
              "abstract": "The emerging class of transient computing systems enables computation to be sustained despite power outages due to the variable nature of energy harvesting. However, existing approaches are largely designed for specific architectures, and hence are not broadly applicable across different IoT devices. Emerging platforms based on portable, hardware-independent software should rely on lightweight operating systems (OSs) designed specifically for embedded IoT applications, such as Arm mbed OS and Contiki OS. To enable the widespread use of transient computing, transient approaches need to be integrated into these operating systems. In this paper, we discuss the challenges of providing software primitives for transient computing to facilitate hardware-independent implementation using standard OS APIs, and present the integration of a state-of-art transient approach, Hibernus into mbed OS. This OS is chosen due to the large community of developers and the open-source IoT code availability. Transient computing is offered through a modular and layered structure that uses the available mbed OS APIs, including different strategies for retaining the system state designed for different types of flash memory. To illustrate the applicability of the proposed design, we implemented Hibernus on two mbed platforms with different flash memories, which respectively requires 4.7mF and 4.9mF of additional storage.",
              "article_number": "8767302"
            },
            {
              "title": "Monitoring Internet of Things Networks",
              "abstract": "To ensure robustness, functionality and Quality of Service in wireless networks, monitoring the network state and functioning of nodes and links is crucial; especially for critical applications. This PhD thesis targets robustness in Internet of Things (IoT) networks. Devices are resource-constrained and connected via lossy links; therefore, fault prevention and rapid repair mechanisms are crucial. Meanwhile, monitoring should minimize the resulting energy and traffic overhead; to leave the network unconstrained during its normal operation. To tackle this problem, several integrated optimization models and efficient algorithms were proposed during the course of PhD. Our activities and results cover the monitor placement and scheduling problems. The topology is represented by a graph, and several graph related optimization problems can be solved. We aim at realizing a polynomial-time solvable monitor placement algorithm. Furthermore, to minimize the monitoring overhead and maximize longevity, monitoring roles should be balanced and alternated amongst nodes; therefore, we target optimal monitor scheduling. We propose a Binary Integer Programming problem formulation. We present the exact solution as well as an efficient heuristic. Extensive experimentation was conducted using different network sizes and topologies. Results confirm effective monitoring with minimum energy consumption and network overhead while balancing the monitoring role between nodes.",
              "article_number": "8767203"
            },
            {
              "title": "A survey on technological, business and societal aspects of Internet of Things by Q3, 2017",
              "abstract": "The Internet of Things (IoT) is one of the most trending technologies of the current era and is expected to cover a significant share of the global market in future. It connects physical objects to make them control and work for our daily chores; making it get its application in different fields of automation, thus reducing human effort. The objective of this paper is to emphasize on the different influencing aspects of IoT, namely Technology, Business and Society. After going through different journals, survey papers, blogs, newsletters, books and other information sources in this field, we pointed out the major Technological challenges of IoT; reviewed some relevant Business matters; and brought forward some affecting Social issues. We start this paper by presenting a brief overview of the IoT, and finally draw a relation among the different aspects of it.",
              "article_number": "8519898"
            },
            {
              "title": "Internet of Things and crowd sourcing - a paradigm change for the research on the Internet of Things",
              "abstract": "This article presents an initial set of results from the IoT Lab European research project on crowd sourcing and Internet of Things (IoT). It gives an overview of the IoT Lab architecture for IoT and crowd sourcing integration, including the use of IPv6 as a global integration enabler. It continues by presenting the IoT Lab specific research model enabling multidisciplinary research and “crowd-driven research” exploiting the potential of the Internet of Things based together with richer end-user interactions.",
              "article_number": "7389087"
            },
            {
              "title": "A survey on the Development and Challenges of the Internet of Things (IoT) in China",
              "abstract": "In recent years, the Internet of Things (IoT) has swept the entire society and drawn significant research attention. IoT is an important part of a new generation of information technology, and it is also an important stage of development in the “informatization” era. The concept of IoT is introduced in this paper, and the global development and strategic plans in US, EU, Japan, Korea and China are described. The development challenges of IoT in China IoT are discussed in detail, with a focus on technology, applications, standards, and security. Some suggestions are given for IoT development in China. The paper aims to provide reference suggestions for the development of IoT.",
              "article_number": "8538281"
            },
            {
              "title": "Utilising Correlated Information to Improve the Sustainability of Internet of Things Devices",
              "abstract": "Billions of low-power devices collecting information will be deployed in Internet of Things (IoT) networks. By taking advantage of the correlation exhibited in information collected, it is possible to improve sensors' energy efficiency. In this paper, we propose an updating mechanism capable of learning from the content of information collected to reduce the frequency with which devices transmit their updates, thus improving their energy efficiency. We show the potential gain of using correlated information and evaluate the proposed updating mechanism using data obtained from real sensing devices to determine the increase in energy efficiency.",
              "article_number": "8767256"
            },
            {
              "title": "IoT Performance Improving for Indoor and Outdoor Environments",
              "abstract": "Internet of Things is a term used to describe a world, in which all disparate objects and devices have ability to address, control, and share information. The technology brings a lot of convenience to human life and consequently introduce a new level of threats, which can simultaneously attack a wide range of facilities and stop providing services. Therefore, investigating, analyzing and securing the types of channels in this growing technology and improving their communication efficiency is of particular importance. In this paper, while categorizing the types of important channels in IoT technology, we provide a solution to improve communication efficiency of each of them. Then, we simulate and analyze the effects of our suggestions for indoor and outdoor applications of IoT.",
              "article_number": "9469604"
            },
            {
              "title": "Extending Two-level Information Modeling to the Internet of Things",
              "abstract": "Interoperability is a major challenge for the Internet of Things (IoT). The real potential of the IoT lies in facilitating largescale sharing of high-quality context-rich information through systems-of-IoT-systems, rather than IoT systems that operate as isolated technology silos. Real large-scale interoperability requires layers of standards, and each layer addresses different interoperability challenges. The SensorThings API data model seeks to tackle data interoperability at the data and informational layers of IoT platforms. SensorThings API is aligned to the ISO/OGC O&M data standard, and like O&M it is semi-structured. Semi-structured models allow for variance within implementations for different use-cases, which is both necessary and detrimental to systems interoperability.In this paper we propose that the SensorThings API data model should be defined as a set of archetypes, used to capture extensible domain concepts using a two-level modeling IoT systems design approach. Extending two-level modeling to the IoT using the SensorThings API as a base for domain concepts definition allows for a powerful framework to manage variance within systems implementation and maintaining semantic interoperability within systems-of-IoT-systems across diverse use-cases.",
              "article_number": "8767355"
            },
            {
              "title": "A digital identity stack to improve privacy in the IoT",
              "abstract": "The Internet of Things increasingly involves collection, processing and transmission of a wide variety of data to services and other devices. Business and engineering considerations are both increasing the volumes and detail of IoT data flows. Reasonably obvious privacy risks result from IoT-connected devices when they emit identifiable information, for this can reveal the activities of device users. More subtle risks arise when bulk device data is available for analysis, and linkage to auxiliary data sets, because identification or re-identification of users can follow. At the same time, security engineers are now designing for the “Identity of Things”, exploiting embedded cryptography and SIM-like modules to help with the authentication and authorization of devices acting as independent agents in the IoT. To help protect privacy while allowing precise authentication, this paper sets out a new model for digital identity management, comprising a stack of identities, attributes, and attribute metadata. As with the familiar OSI network stack, the digital identity stack helps to decouple different layers of authentication technology, so that IoT data is shared on an explicit need-to-know basis, and extraneous disclosures are minimized.",
              "article_number": "8355199"
            },
            {
              "title": "From Micro to Macro IoT: Challenges and Solutions in the Integration of IEEE 802.15.4/802.11 and Sub-GHz Technologies",
              "abstract": "Research efforts in the field of Internet of Things (IoT) are providing solutions in building new types of “network of networks,” going beyond the technological barriers due to intrinsic limitations of the constrained devices typically used in this context. Thanks to the improvement in communication/networking protocols and the hardware cost reduction, it is now possible to define new IoT architectures, combining the “micro” IoT paradigm, based on short-range radio technologies (e.g., IEEE 802.15.4 and IEEE 802.11), with the rising “macro” IoT paradigm, based on sub-GHz radio technologies. This allows the implementation of scalable network architectures, able to collect data coming from constrained devices and process them in order to provide useful services and applications to final consumers. In this paper, we focus on practical integration between micro and macro IoT approaches, providing architectural and performance details for a set of experimental tests carried out in the campus of the University of Parma. We then discuss challenges and solutions of the proposed micro-macro integrated IoT systems.",
              "article_number": "8024171"
            },
            {
              "title": "The Role of the Internet of Things in the Telecom Sector",
              "abstract": "Internet of Things (IoT) integration in telecoms might revolutionize connections and services, opening up new possibilities for creativity, efficiency, and better customer experiences. The Internet of Things (IoT) has the ability to radically alter the telecom business, according to this research. on network architecture, service delivery, and business models. To begin, IoT enables the development of smarter, more robust network infrastructure by deploying linked devices and sensors. These devices offer real-time monitoring, predictive maintenance, and proactive management of network infrastructure, resulting in increased dependability, lower downtime, and better resource usage. Second, IoT-driven data analytics and insights enable telecommunications firms to provide customized services and experiences to their consumers. Telecom companies may increase their service offerings and income streams by using massive volumes of data created by connected devices. Examples include smart home automation, linked automobiles, and industrial IoT applications. Furthermore, IoT accelerates the transition to 5G networks by opening up new use cases and applications that need ultra-low latency, high dependability, and huge connection. From self-driving cars to remote healthcare monitoring, IoT expands the capabilities of 5G networks, opening up new opportunities for companies and consumers alike. Despite its enormous promise, IoT in the telecommunications business poses security, privacy, interoperability, and scalability concerns. Addressing these concerns needs strong cybersecurity measures, industry standards, and stakeholder engagement to maintain the integrity, confidentiality, and resilience of IoT-enabled networks and services. Finally, IoT is altering the telecommunications environment, promoting innovation, efficiency, and competition across the sector. To prosper in the digital age and fulfill the changing expectations of consumers and organizations, telecommunications firms must embrace and fully use IoT technology.",
              "article_number": "10550390"
            },
            {
              "title": "A framework for Security and protection in Internet of things (IoT) devices",
              "abstract": "These days Internet of Things (IoT) has transformed into an extreme ponder which created strides in practically all fields of human life. This examination paper gives a survey of Internet of things and its engaging developments, security issues and creating applications in the remote progressions. There are enormous number of employments of Internet of things in essentially all aspects of life i.e. therapeutic administrations, collaborations and generation organize organization, savvy condition and social application et cetera thusly security is a fundamental stress of remote frameworks accordingly it is one of the rule issues in Internet of things. The following paper will provide a layout of some of the various security stresses in an Internet of things system, perils identified with it, challenges and a framework to protect Iot devices from such security issues.",
              "article_number": "8668121"
            },
            {
              "title": "Recent Advances in Information-Centric Networking-Based Internet of Things (ICN-IoT)",
              "abstract": "Information-centric networking (ICN) is being realized as a promising approach to accomplish the shortcomings of current Internet protocol-address-based networking. ICN models are based on naming the content to get rid of address-space scarcity, accessing the content via name-based-routing, and caching the content at intermediate nodes to provide reliable, efficient data delivery, and self-certifying contents to ensure better security. Obvious benefits of ICN in terms of fast and efficient data delivery and improved reliability raises ICN as highly promising networking model for Internet of Things (IoT) like environments. IoT aims to connect anyone and/or anything at any time by any path on any place. From last decade, IoT attracts both industry and research communities. IoT is an emerging research field and still in its infancy. Thus, this paper presents the potential of ICN for IoT by providing state-of-the-art literature survey. We discuss briefly the feasibility of ICN features and their models (and architectures) in the context of IoT. Subsequently, we present a comprehensive survey on ICN-based caching, naming, security, and mobility approaches for IoT with appropriate classification. Furthermore, we present operating systems and simulation tools for ICN-IoT. Finally, we provide important research challenges and issues faced by ICN for IoT.",
              "article_number": "8478349"
            },
            {
              "title": "Secret Key based Sensor Node Security in the Internet of Things (IoT)",
              "abstract": "Security in Internet of Things (IoT) deals with safeguarding connected objects and networks. IoT involves the growing collection of objects known as things with unique identifiers. These objects have the ability to automatically transfer data over a network. Most of the increase in IoT communication comes from computing devices and embedded sensor systems which are used in industrial machine-to-machine (M2M) communication, home and building automation, vehicle to vehicle communication, smart energy grids, and wearable devices. Because the idea is to connect all physical objects to Internet, security has not always been measured in product design. The IoT products fail to select sufficiently strong security. Therefore, security is one of the important factors in IoT that should be taken care on priority basis. This study proposes IoT architecture which deals with security of devices. The main aim of this study is to make sure that an authentic device uploads the data and restrict false data being uploaded by devices trying to be an authentic device. The study presents a strong authentication technique based on secret keys which protects the identity of IoT devices in the network. The authentication and authorization techniques presented in this paper ensure that the right data is sent and received by right devices at right places and for right purpose.",
              "article_number": "9138078"
            },
            {
              "title": "Analysis of the FM radio spectrum for Internet of Things opportunistic access via Cognitive Radio",
              "abstract": "The emerging employment of low-power short-range Internet of Things (IoT) devices, coupled with the rapid growth of wireless devices in general, is creating a problem by placing an overwhelming demand on the radio spectrum. This overwhelming demand is causing a shortage of radio spectrum. To combat this shortage, IoT devices need to be able to identify vacant radio spectrum that can be used in an opportunistic manner through Cognitive Radio (CR). This paper presents a methodology to determine utilization of FM radio spectrum, which would support efficient IoT device communication via CR. The methodology is showcased by analyzing the FM radio spectrum in an urban area and determining its capacity to support IoT device communication. The results show that the spectrum in the urban area is 76% underutilized. Therefore, the FM radio spectrum appears to be an excellent candidate to support low-power short-range IoT devices through CR.",
              "article_number": "7389046"
            },
            {
              "title": "Making Internet of Things Real",
              "abstract": "The Internet of Things (IoT) is driving the next wave of innovation in both business models and technology. While the IoT revolution, as it is being called, promises to be a major driver of economic activity and many businesses are coming onboard, if it is not approached with both business and technology perspectives together, the desired outcomes may not always be achieved. In this article we take a fresh look at IoT as a business revolution driven by technology. Our key contribution is the definition of business and technology drivers that need to be considered when choices are being made for adoption of IoT in a business. We provide case studies of actual businesses who have successfully transformed themselves into IoT-based businesses, and we provide examples of key business and technology drivers considered by them.",
              "article_number": "8835419"
            },
            {
              "title": "Review of Internet of Things (IoT): Security Issue and Solution",
              "abstract": "Internet of Things (IoT) is a novel research domain of the Internet that offers smart device cooperation with other devices anywhere and anytime. IoT consists of sensor devices and embedded devices that are allowed to connect and exchange information through the Internet. It is designed to speed to exchange information, however, it does not concern about security properties. A number of researchers have presented these issues of the security properties into the general architecture of every layer such as perception layer, network layer, and application layer. Therefore, in this paper, we propose a common survey of the security problems in IoT and the security solutions on all layers for example perception layer, network layer, and application layer of IoT. The result illustrated that the authentication is one of the most significant security properties.",
              "article_number": "9157904"
            },
            {
              "title": "Cellular IoT Traffic Characterization and Evolution",
              "abstract": "The adoption of Internet of Things (IoT) technologies is increasing and thus IoT is seemingly shifting from hype to reality. However, the actual use of IoT over significant timescales has not been empirically analyzed. In other words the reality remains unexplored. Furthermore, despite the variety of IoT verticals, the use of IoT across vertical industries has not been compared. This paper uses a two-year IoT dataset from a major Finnish mobile network operator to investigate different aspects of cellular IoT traffic including temporal evolution and the use of IoT devices across industries. We present a variety of novel findings. For example, our results show that IoT traffic volume per device increased three-fold over the last two years. Additionally, we illustrate diversity in IoT usage among different industries with orders of magnitude differences in traffic volume and device mobility. Though we also note that the daily traffic patterns of all devices can be clustered into only three patterns, differing mainly in the presence and timing of a peak hour. Finally, we illustrate that the share of LTE-enabled IoT devices has remained low at around 2% and 30% of IoT devices are still 2G only.",
              "article_number": "8767323"
            },
            {
              "title": "IoT: Challenges and Issues in Indian Perspective",
              "abstract": "Internet of Things is the Connections of embedded technologies that containedphysical objects and is used to communicate and intellect or interact with the inner states or the external surroundings.Rather than people to people communication, IoT emphasis on machine to machine communication. This paper familiarises the status of IoT growth In India, and also contains security issues challenges.Finally, this paper reviews the Risk factor, security issues and challenges in Indian perspective.",
              "article_number": "8519869"
            },
            {
              "title": "Smart World of Internet of Things (IoT) and Its Security Concerns",
              "abstract": "Due to increasing number of internet users, popularity of Broadband Internet also increasing. Hence the connection cost should be decrease due to Wi Fi connectivity and built-in sensors in devices as well the maximum number of devices should be connected through a common medium. To meet all these requirements, the technology so called Internet of Things is evolved. Internet of Things (IoT) can be considered as a connection of computing devices like smart phones, coffee maker, washing machines, wearable device with an internet. IoT create network and connect \"things\" and people together by creating relationship between either people-people, people-things or things-things. As the number of device connection is increased, it increases the Security risk. Security is the biggest issue for IoT at any companies across the globe. Furthermore, privacy and data sharing can again be considered as a security concern for IoT. Companies, those who use IoT technique, need to find a way to store, track, analyze and make sense of the large amounts of data that will be generated. Few security techniques of IoT are necessary to implement to protect your confidential and important data as well for device protection through some internet security threats.",
              "article_number": "7917092"
            },
            {
              "title": "SAT-IoT: An Architectural Model for a High-Performance Fog/Edge/Cloud IoT Platform",
              "abstract": "Current new IoT standards do not detail enough some important and emergent aspects as the Fog/Edge computing support, the IoT computation topology management or the IoT visualization systems. This work defines three new concepts: a) the paradigm of edge/cloud computing transparency that lets the computation nodes change dynamically without administrator intervention; b) the IoT computing topology management that gives an IoT system global view, from the hardware and communication infrastructures to the software deployed on them, and c) the automation and integration of IoT visualization systems for real time data visualization, current IoT topology and current paths of data flows. It is also defined a new architectural model that includes these concepts and covers other IoT demands, like security safeguard services based on Blockchain. This architectural model definition is taken as the basis for developing a new advanced IoT platform referred as SAT-IoT.",
              "article_number": "8767282"
            },
            {
              "title": "Blockchain: A game changer for securing IoT data",
              "abstract": "Internet of Things (IoT) is now in its initial stage but very soon, it is going to influence almost every day-to-day items we use. The more it will be included in our lifestyle, more will be the threat of it being misused. There is an urgent need to make IoT devices secure from getting cracked. Very soon IoT is going to expand the area for the cyber-attacks on homes and businesses by transforming objects that were used to be offline into online systems. Existing security technologies are just not enough to deal with this problem. Blockchain has emerged as the possible solution for creating more secure IoT systems in the time to come. In this paper, first an overview of the blockchain technology and its implementation has been explained; then we have discussed the infrastructure of IoT which is based on Blockchain network and at last a model has been provided for the security of internet of things using blockchain.",
              "article_number": "8355182"
            },
            {
              "title": "A Similarity based Trust Model to Mitigate Badmouthing Attacks in Internet of Things (IoT)",
              "abstract": "In Internet of Things (IoT) each object is addressable, trackable and accessible on the Internet. To be useful, objects in IoT co-operate and exchange information. IoT networks are open, anonymous, dynamic in nature so, a malicious object may enter into the network and disrupt the network. Trust models have been proposed to identify malicious objects and to improve the reliability of the network. Recommendations in trust computation are the basis of trust models. Due to this, trust models are vulnerable to bad mouthing and collusion attacks. In this paper, we propose a similarity model to mitigate badmouthing and collusion attacks and show that proposed method efficiently removes the impact of malicious recommendations in trust computation.",
              "article_number": "8767170"
            },
            {
              "title": "NFV enabled IoT architecture for an operating room environment",
              "abstract": "The Internet of Things (IoTs) refers to the inter-connection of billions of smart devices. The steadily increasing number of IoT devices with heterogeneous characteristics requires that future networks evolve to provide a new architecture to cope with the expected increase in data generation. Network function virtualization (NFV) provides the scale and flexibility necessary for IoT services by enabling the automated control, management and orchestration of network resources. In this paper, we present a novel NFV enabled IoT architecture targeted for a state-of-the art operating room environment. We use web services based on the representational state transfer (REST) web architecture as the IoT application's southbound interface and illustrate its applicability via two different scenarios.",
              "article_number": "8355128"
            },
            {
              "title": "Security and Privacy in the Internet of Things (IoT): Survey",
              "abstract": "Internet of things becomes important and its applications have widely used in the last years. These applications need a protection system against different attacks. This paper study the recent IoT Security researches and classifies them into the following tends Cryptography, Authentication, Blockchain, and data privacy preserving. And at last of this paper gives the conclusions and future work.",
              "article_number": "9072929"
            }
          ]
    },
    {
        "id": 2,
        "query": "(\"Document Title\":internet of things   OR   (\"Document Title\":iot  AND \"Document Title\":device  )  )  AND (\"Abstract\":security NOT  \"Abstract\":visual OR \"Document Title\":network)",
        "documents": [
            {
              "title": "How to hack into the IOT: An E&T investigation carried out with leading cyber-threat experts reveals how simple it is to hack web-connected Internet of Things (IoT) devices and explores the implications for consumers and critical infrastructure in the UK",
              "abstract": "THE UBIQUITOUSNESS of IoT devices — often dubbed “internet of sh..t”, according to one expert interviewed at InfoSecurity, the annual cyber-security conference held in London — means hackers have a conformable way into systems and our private lives. Even more worryingly, it also means they have potential access to the critical infrastructure systems that run our daily lives.",
              "article_number": "9246805"
            },
            {
              "title": "Security of RFID-based on internet of things (IOT) devices",
              "abstract": "The technology in this era is expanding enormously where machines can interact with each other as Internet of Things (IoT). The connection of machines requires the assurance of confidentiality, integrity and availability of data, the risk on devices rise when gaps are created in lack of security. The main layers in the architecture of the Internet of Things (IoT); application layer, network layer, and physical layer. Securing all layers from infrastructure layer to application layer will prevent unusual acts. The wireless communication transmits data that is private and sensitive information, in the Internet of Things (IoT) the connections are applied in all devices where it can face a high risk in explosion of the data in the wireless system. Our issue relays on the vulnerabilities in the security of the devices. The aim of this paper is to address the different layers issues of the Internet of Things (IoT) devices. It shows a method that would solve the issues in structure devices as the Radio Frequency Identification (RFID). This review paper shows different attacks that faces these devices, architectures, challenges, security issues, security methods, and limitations in Internet of Things (IoT) devices.",
              "article_number": "9545771"
            },
            {
              "title": "Classifying internet of things (IoT) devices and non-IoT devices in data center edge network by one dimensional convolutional neural network using behavioral data",
              "abstract": "Now a days it is important to distinguish IoT and non-IoT devices from their network traffic in real-time for providing differential treatment to meet quality of service (QoS) requirements. This paper focuses on the classification of IoT and non-IoT devices based on their network traffic at edge data centers. We proposed a method using One-Dimensional Convolutional Neural Networks (1D-CNNs) which are simple, compact, and computationally less expensive for real-time processing needs. We used a dataset, which contain information from 22 IoT and 7 non-IoT devices that included both User Datagram Protocol (UDP) and Transport Control Protocol (TCP) flows. The classifier is constructed using 8 consecutive timesteps of payload exchanges carrying network payload data up to 96 bytes. Using 10-CV, the classifier achieves an accuracy of classification of about 98% on the test datasets.",
              "article_number": "10220175"
            },
            {
              "title": "Classifying Internet of Things (IoT) devices and non-IoT devices in data center edge network using statistical and network flow features by one dimensional convolutional neural network",
              "abstract": "The development of edge computing has led to the aggregation of traffic from IoT and non-IoT devices at edge data center networks located closer to cloud and computing resources. To provide application-specific Quality of Service (QoS) for these devices, classification of IoT and non-IoT devices at edge data centers is crucial. Our research suggests using a simple, compact, and computationally less expensive shallow one-dimensional convolutional neural network (1D-CNN) for real-time processing needs. The model was trained on a dataset consisting of 22 IoT devices and 7 non-IoT devices. The network flow and statistical features extracted from the network traces of these devices were fed into the model. The research demonstrated that with just 15 features, the model can achieve around 94% accuracy, and with 55 features, nearly 97% accuracy in classifying IoT and non-IoT devices.",
              "article_number": "10220173"
            },
            {
              "title": "Toward Secured Internet of Things (IoT) Networks: A New Machine Learning based Technique for Fingerprinting of Radio Devices",
              "abstract": "The process of identifying and authenticating Internet of Things (IoT) devices based on the electromagnetic characteristics of their wireless interfaces is a topic that has been receiving a lot of attention lately due to the continuous growth in the market of embedded and wearable wireless devices. Securing the networks to whom these devices are connecting daily has become a significant security challenge, which is threatening the security and safety of thousands, maybe millions of private and public networks due to the vulnerable nature of wireless devices to a well-known set of possible attacks.In this paper, we present the initial results acquired from our work-in-progress to develop new radio-features-extraction-based technique to identify wireless devices, specifically Internet of Things (IoT) ZigBee and LoRa devices. This paper summarizes our initial experimental setup to gather and analyze the devices signals to extract the desired features and describes the signal pre-processing approach and the machine learning methods that we attempted to date.",
              "article_number": "9700704"
            },
            {
              "title": "Usercentric federation of access to Internet-of-Things(IoT) devices: A valet key for IoT devices",
              "abstract": "Therapidly expanding use of the Internet for individual-driven needs coupled with the emergence of IoT devices calls for an identity management solution that opens-up closed systems to qualify users and devices securely anywhere on the Internet. This paper attempts to provide an objective overview of a user-centric identity and access management solution for securing the IoT devices that can help alleviate some of the security challenges prevalent in IoT ecosystem.",
              "article_number": "8053280"
            },
            {
              "title": "Development of IoT Gateway and Cloud Platform for Software Defined Mesh Network of Internet of Things Devices",
              "abstract": "Mesh networks are becoming increasingly popular in the field of the Internet of Things. The use of such networks allows you to create distributed systems where devices can exchange data with each other without the need to connect to a central server. The aim of the work is to develop an IoT gateway that provides interaction between IoT devices, collects data from a software defined mesh network of Internet of Things devices and transmits them to a cloud platform for further processing. The cloud platform, in turn, provides storage, processing and analysis of data from Internet of Things devices, as well as provides various services that allow you to monitor the status of devices and manage them. To confirm the effectiveness of the proposed approach, a visual software system IoT Configuration Map has been developed, which allows you to automate the process of configuring Internet of Things devices, and also displays data from devices and network topology.",
              "article_number": "10272962"
            },
            {
              "title": "A Secure Corroboration Protocol for Internet of Things (IoT) Devices Using MQTT Version 5 and LDAP",
              "abstract": "The world is now shifting from Industry 4.0 to Industry 5.0 enabling the automation of the human livelihood by using Internet of Things (IoT). IoT can be attributed as a network that connects many sensor devices to collect data to provide automated smart environments. However, with a huge number of connected devices already deployed worldwide and organizations resorting to IoT development services more frequently because IoT security issues remain a matter of concern. One of the main identified reasons is IoT devices possess limited memory capacity, energy, processing which cause difficulties to run complex security algorithms, hindering the security services such as privacy and authentication, although those are crucial factors of IoT services. Hence, the adoption of adequate security and authentication techniques are necessary for a broad IoT deployment. To this end, this study proposes an authentication platform to improve the security and efficiency of data transmission between the IoT devices using LDAP and MQTT technologies. The implementation complies with IEEE 1451 standardization to uplift the MQTT with the help of LDAP features and GZip compression.",
              "article_number": "9333910"
            },
            {
              "title": "A framework for Security and protection in Internet of things (IoT) devices",
              "abstract": "These days Internet of Things (IoT) has transformed into an extreme ponder which created strides in practically all fields of human life. This examination paper gives a survey of Internet of things and its engaging developments, security issues and creating applications in the remote progressions. There are enormous number of employments of Internet of things in essentially all aspects of life i.e. therapeutic administrations, collaborations and generation organize organization, savvy condition and social application et cetera thusly security is a fundamental stress of remote frameworks accordingly it is one of the rule issues in Internet of things. The following paper will provide a layout of some of the various security stresses in an Internet of things system, perils identified with it, challenges and a framework to protect Iot devices from such security issues.",
              "article_number": "8668121"
            },
            {
              "title": "New Replay Attacks on ZigBee Devices for Internet-of-Things (IoT) Applications",
              "abstract": "The ZigBee wireless technologies have been widely applied in Internet of Things (IoT) applications. Among all identified security threats, replay attack is one of the major challenges. Although the firmware and authentication algorithms for ZigBee devices are being updated over the time, the security measures for ZigBee enabled IoT devices cannot efficiently thwart all replay attacks. As new sniffing devices are available on the market, new replay attacks will further challenge the integrity of the communication between ZigBee devices. This work proposes a new replay attack to reveal the security vulnerabilities of the existing commercial ZigBee devices, Phillips Hue bulbs and Xbee S1 and S2C modules. Two case studies performed in this work confirm that the proposed replay attack can successfully transmit the captured packets to the victim device in spite of the built-in countermeasures.",
              "article_number": "9301593"
            },
            {
              "title": "A Comparative Method for Securing Internet of Things (IoT) Devices: AES vs Simon-Speck Encryptions",
              "abstract": "Delivering information from Internet of Things (IoT) devices to a cloud server possesses several security issues, e.g. information eavesdropping, modification, and theft. Therefore, communication between IoT devices and the cloud server should be protected by encryption methods. However, there are few encryption techniques options that are suitable for the need for lightweight communication as demanded by the IoT devices. Due to these circumstances, the NSA launched an encryption algorithm for IoT named Simon and Speck, which are maximally efficient while still providing the advertised level of security, as determined by the key size. This study aims to test and compare the Simon-Speck and AES encryption algorithms and their effect on networking performance on IoT devices. The parameters in this test are delay, throughput, the efficiency of memory usage from the encryption algorithm, and the value of the avalanche effect. Experimental results show that the Speck algorithm outperforms the Simon and the AES algorithms in terms of communication delay and memory usage. Regarding the avalanche effect values, the Simon algorithm possesses the highest avalanche effect value on average against the Speck and the AES algorithms.",
              "article_number": "9872666"
            },
            {
              "title": "Preventing Data Counterfeiting Among Internet of Things (IoT) Devices using Ethereum Blockchain",
              "abstract": "In today's world we are surrounded with lot of IoT devices and sensors. This IoT devices has made our life easier and more comfortable utilizing the Blockchain and increase the security and efficiency of network. key features of Blockchain will bring resistance to unauthorized modification and devices. The Rapid development in this technology of IoT is getting into pool and Rapid more data is transmitted and process over the communication channels. As a result, these devices is deployed worldwide and even more advanced requirement in the practical application and performance. Most of the devices are highly centralized architecture and which then suffers from technical limitation as well as they suffer from cyber attacks. To solve this problem, we propsed a system in which a gateway is introduced. The role of the Gateway in smartphones is the most beneficial, yet it is a unified structure that presents many security issues such as integrity, certification and availability. This network consists of three levels, including smart home devices, gateways and clouds. Blockchain infrastructure is provided in the gateway layer so that data can be processed and shared as blocks. Blockchain guarantees the confidentiality of internal data outside smart homes and the availability by way of authentic communication between the application of the network for Ethereum-based Blockchain technologies, including time and precision, to promote decentralization and overcome the central architecture issue.",
              "article_number": "9509640"
            },
            {
              "title": "Uninvited Connections: A Study of Vulnerable Devices on the Internet of Things (IoT)",
              "abstract": "The Internet of Things (IoT) continues to grow as uniquely identifiable objects are added to the internet. The addition of these devices, and their remote connectivity, has brought a new level of efficiency into our lives. However, the security of these devices has come into question. While many may be secure, the sheer number creates an environment where even a small percentage of insecure devices may create significant vulnerabilities. This paper evaluates some of the emerging vulnerabilities that exist and puts some figures to the scale of the threat.",
              "article_number": "6975580"
            },
            {
              "title": "Identifying vulnerabilities of consumer Internet of Things (IoT) devices: A scalable approach",
              "abstract": "The Internet of Things becomes more defined year after year. Companies are looking for novel ways to implement various smart capabilities into their products that increase interaction between users and other network devices. While many smart devices offer greater convenience and value, they also present new security vulnerabilities that can have a detrimental effect on consumer privacy. Given the societal impact of IoT device vulnerabilities, this study aims to perform a large-scale vulnerability assessment of consumer IoT devices exposed on the Internet. Specifically, Shodan is used to collect a large testbed of consumer IoT devices which are then passed through Nessus to determine whether potential vulnerabilities exist. Results of this study indicate that a significant number of consumer IoT devices are vulnerable to exploits that can compromise user information and privacy.",
              "article_number": "8004904"
            },
            {
              "title": "Challenges of Testing Complex Internet of Things (IoT) Devices and Systems",
              "abstract": "The rise of Internet of Things (IoT) in past few decades is commendable. This significant growth clearly states the importance of security from internet threats. IoT systems involve numerous devices and ad-hoc embedded systems that require internet access and the amalgamation of various cloud technologies. IoT is a budding industry that provides variety of products, services and systems and therefore requires quality assurance. These systems are very complex in nature and are used in real world environments. For these reasons, IoT systems and devices are obliged to testing. It is a challenge to the testing community because of its issues, complexity and newness. The paper discusses the IoT systems and devices and the types of testing performed to them. It also highlights the challenges on testing these complex systems because of their issues and tells a few proposed solutions from literature to solve some part of these problems.",
              "article_number": "8919324"
            },
            {
              "title": "LQI-Key: Symmetric Key Generation Scheme for Internet-of-Things (IoT) Devices Using Wireless Channel Link Quality",
              "abstract": "One of the important part of IoT ecosystem is wearable device technology, that has many applications in day to day life. Due to resource constraints, complex security protocols are not feasible for tiny wearable devices. Hence, alternative approaches employing wireless channel characteristics have been proposed by many researchers. In this work, we propose a novel symmetric key generation scheme for wearable IoT devices that exploits the unique features of wireless channel link quality indicator (LQI), compared to other parameter e.g., received signal strength (RSS) used in prior work. We select LQI as a parameter of interest since it is the measure of the channel link quality connecting two communicating parties, whereas RSS is the total energy measured by radio including noise. We implement our solution on of f-the-shelf IoT devices and demonstrate experimentally that our scheme is lightweight and suitable for practical applications.",
              "article_number": "8479465"
            },
            {
              "title": "The Detection of Mirai Botnet Attack on the Internet of Things (IoT) Device Using Support Vector Machine (SVM) Model",
              "abstract": "There are various types of attacks on IoT devices, one of which is Mirai botnet that attacks a number of IoT devices such as web cameras, security cameras, and routers. Even it has caused internet downtime for the users in Europe and North America. Hence, it is deemed necessary to have a system to detect Mirai botnet attack using the Support Vector Machine (SVM) model. This model becomes a solution to detect Mirai botnet attacks for having good generalization performance when the parameter is properly configured in modeling the training set (training dataset) and getting good classification results without a lot of training data. The results of the analysis from the use of the SVM model showed the accuracy of 92.91% with a linear kernel and max_iter 10000. Also, the performance of the Support Vector Machine (SVM) model based on the precision parameter obtained a value of 94.13% with max_iter 10000 and the recall parameter resulted in a value of 91.10% with max_iter 10000.",
              "article_number": "9914830"
            },
            {
              "title": "Distributed Denial of Services (DDoS) Botnet Attack Prevention in Internet of Things (IoT) Devices Using AI",
              "abstract": "The expeditious adoption of Internet of Things (IoT) devices has facilitated the emergence of complex cybersecurity risks, notably Distributed Denial of Service (DDoS) botnet assaults, which pose a substantial danger. With the exponential growth of interconnected devices inside the Internet of Things (IoT), the task of identifying malicious linkages becomes more challenging. The identification of these hazards has significant importance for intrusion detection systems (IDS), with the use of machine learning (ML) having been a prevailing practice due to the continuous advancement of cyberattacks. In order to effectively combat such dangers, it is essential that machine learning technologies has the capability to observe a diverse range of attack patterns, hence illustrating the intricacies involved in targeting network traffic. Regrettably, a significant portion of the datasets accessible to the machine learning community lack comprehensive representation of well recognized attack patterns. This is particularly true for datasets pertaining to Distributed Denial of Service (DDoS) attacks, such as ACK and PUSH-ACK floods. The objective of this project is to address the existing disparity by curating a compilation of assault approaches that are underutilized. This dataset provides IDS developers with the necessary resources to enhance their detection rates. This research work enhances the security of IoT devices against DDoS botnet assaults, hence contributing to the overall safety of the IoT ecosystem.",
              "article_number": "10442302"
            },
            {
              "title": "Enabling Secure Multicast Group Communications in IP Wireless Networks for the Internet of Things",
              "abstract": "Internet-based networks face technical challenges establishing efficient communications infrastructure while keeping inter-application message exchange secure. Group communications based on transport or network layer security is a way to reduce the number of required transmissions for common message exchanges. In this work, we study secure multicast protocols for group communications in IP wireless networks for the Internet of Things (IoT) with focus on two protocols: Datagram Transport Layer Security (DTLS) and Internet Protocol Security (IPsec). We review the performance of Elliptic Curve Cryptography (ECC) in wireless sensor nodes with the TelosB mote to address the feasibility of the underlying cryptosystem. Then, we review the performance of unicast and multicast as transmission modes. Later, we introduce our implementation of a DTLS-based multicast security that shows 3x to 4x reductions in application payload transmissions for the largest group sizes. Finally, a comparison between the DTLS-based multicast security and IPsec for application payload is presented, where we argue for DTLS.",
              "article_number": "8835944"
            },
            {
              "title": "A New Model for Secure Joining to ZigBee 3.0 Networks in the Internet of Things",
              "abstract": "In these days, Internet has become an important part of the life. Especially in the modern Internet world, Internet of Things (IoT) is one of the most used technologies. IoT is a technology that collects and controls data including objects that communicate with each other with protocols. There are some cyber-attacks to the smart objects in IoT because they are connected to each other and the Internet. Due to the negative consequences of these attacks, information security of IoT becomes important. In this paper, ZigBee, that is one of the most common IoT technologies, is analyzed. A new model is proposed as a solution to vulnerability in ZigBee and the results of this model are evaluated.",
              "article_number": "8625315"
            },
            {
              "title": "Study on the influence of IOT (Internet of Things) on mobile network",
              "abstract": "Mobile communication network provides the terminals of IOT (Internet of Things) with a convenient way to access the network. However a large number of connected IOT terminals will inevitably produce a significant impact on the existing mobile communication network. After summarizing the characteristics of typical applications of IOT, this review provides analysis of the specific impact of IOT on mobile network, and finally proposes the corresponding solutions.",
              "article_number": "6192939"
            },
            {
              "title": "EDITOR Sergio Saponara University of Pisa, Italy Enabling Technologies for the Internet of Things: Wireless Circuits, Systems and Networks",
              "abstract": "",
              "article_number": "9450121"
            },
            {
              "title": "Internet of Things: Issues in using mobile communication network",
              "abstract": "Internet of Things (IoT) is an emerging technology that effectively collects data from billions of connected things using sensors and devices, derives intelligence, builds context and helps transform the way businesses are run, as well as our society. IoT enables new use cases due to real time information from things. IoT uses various Communication Networks to send information from sensors and devices to the server in the cloud for analysis. One of the popular networks is mobile communication network. Mobile communication is ideal for connecting things on the move and things outside premises. For example, it is used heavily in transport and logistics industries for real time location of vehicles on the move using GPS technology. This paper discusses various issues that arise in using mobile communication networks for IoT device-server connectivity and suggests possible solutions as well.",
              "article_number": "8372188"
            },
            {
              "title": "Smart network society applied internet of things",
              "abstract": "ICT contributes to construct to the affluent society, putting into the practice of the sophisticated transportation systems, the social safety & secure platform, the monitoring system for lessening the environmental burden such as reducing CO2 emissions and so on. We call “Smart Network Society”, it's the concept of the world view constructing by ICT near future. Then we expect ICT become the one of the resource solving the appearance social issues. Smart Network Society try to achieve the user centric environment where ICT can be utilized using an intuitive and user-friendly interface. It's like the electricity power supply, the gas service and the waterworks. Internet of things (IOT) technologies will contribute for them and build up the environment applied the computing power. IOT technologies and solutions will be able to be universally used, so that all citizens can have worry-free access to ICT and receive the benefits thereof in this society. In this session, I'll talk about the Japanese experience from points of view such as the policy, model projects, user experience and apparent subjects based the activities in Japan last decade. Beside, I'll refer to Chinese IOT strategy named “Wulianwang” and some of business opportunity in China through the collaboration between China and Japan.",
              "article_number": "5696836"
            },
            {
              "title": "Enabling Technologies for the Internet of Things: Wireless Circuits, Systems and Networks",
              "abstract": "",
              "article_number": "9450139"
            },
            {
              "title": "The study on the model of modularity enterprise value networks of telecom operators in the internet of things",
              "abstract": "The rise and development of Internet of Things has a profound impact on the enterprise. Firstly this paper reviews the related modularization theories. Secondly it construct a model of modularity enterprise value network of a telecom operator according to its status and advantages in the Internet of things industry. Finally this paper presents strategy proposals for the telecom operator.",
              "article_number": "5972232"
            },
            {
              "title": "Self-Supervised Learning IoT Device Features With Graph Contrastive Neural Network for Device Classification in Social Internet of Things",
              "abstract": "Device Classification (DC) is one of the critical network management means in the Internet of Things (IoT). Most machine learning-driven DC methods are implemented in two steps: firstly, extracting device features, and then training the classifier. Thus, for the same classifier, the quality of device features plays a decisive role. However, for one thing, these methods usually merely consider device traffic or device attributed features, ignoring the complex relationship between devices in Social IoT. For another thing, these features fed to the classifier are often selected manually without automatic learning. These two factors seriously affect the performance and flexibility of the algorithm. To address the above issues, we propose a novel Graph Contrastive Neural Network-based algorithm for DC dubbed GCNNDC. Specifically, based on the complex relationship between heterogeneous objects in Social IoT and the attribute information of the device itself, we first construct four kinds of homogeneous device-device attributed networks as the input of the neural network. Then, we train a novel GCNN model to learn informative device features in a self-supervised learning fashion. Finally, we leverage the features to train a classifier to complete the DC task. Experimental results on real-world IoT network dataset demonstrate the superiority of GCNNDC.",
              "article_number": "10059194"
            },
            {
              "title": "Social Internet of Things: The collaboration of Social Network and Internet of Things and its Future",
              "abstract": "The Internet of Things promised to be a wellspring of unimaginable preferences to our lives. Engaging independent interchanges between social frameworks and Internet of Things (IoTs) is a rising interdisciplinary area and is using present day promising perspective of Social Internet of Things (SIoTs).The principal focuses of social internet of things is to separate the two levels of people and things to empower things to have their own relational association to enable people to force guidelines to secure their protection and just access the consequence of self-governing between question connections happening on the protest's informal community. Splendid protest won't have any sort of impact; anyway social things will make it. The essential duties are to recognize the correct game plans for the establishment and the organization of social association between things. To portray a possible plan for the Internet of things that consolidates the functionalities to facilitate things into relational association. The objectives being searched after by the SIoT perspective are obvious to empower individuals to drive guidelines to make sure about their security and simply access the delayed consequence of self-administering between question affiliations occurring on the articles' social framework.",
              "article_number": "9362847"
            },
            {
              "title": "Internet of Malicious Things: Correlating Active and Passive Measurements for Inferring and Characterizing Internet-Scale Unsolicited IoT Devices",
              "abstract": "Advancements in computing, communication, and sensing technologies are making it possible to embed, control, and gather vital information from tiny devices that are being deployed and utilized in practically every aspect of our modernized society. From smart home appliances to municipal water and electric industrial facilities to our everyday work environments, the next Internet frontier, dubbed IoT, is promising to revolutionize our lives and tackle some of our nations' most pressing challenges. While the seamless interconnection of IoT devices with the physical realm is envisioned to bring a plethora of critical improvements in many aspects and diverse domains, it will undoubtedly pave the way for attackers that will target and exploit such devices, threatening the integrity of their data and the reliability of critical infrastructure. Further, such compromised devices will undeniably be leveraged as the next generation of botnets, given their increased processing capabilities and abundant bandwidth. While several demonstrations exist in the literature describing the exploitation procedures of a number of IoT devices, the up-to-date inference, characterization, and analysis of unsolicited IoT devices that are currently deployed \"in the wild\" is still in its infancy. In this article, we address this imperative task by leveraging active and passive measurements to report on unsolicited Internet-scale IoT devices. This work describes a first step toward exploring the utilization of passive measurements in combination with the results of active measurements to shed light on the Internet-scale insecurities of the IoT paradigm. By correlating results of Internet-wide scanning with Internet background radiation traffic, we disclose close to 14,000 compromised IoT devices in diverse sectors, including critical infrastructure and smart home appliances. To this end, we also analyze their generated traffic to create effective mitigation signatures that could be deployed in local IoT realms. To support largescale empirical data analytics in the context of IoT, we make available the inferred and extracted IoT malicious raw data through an authenticated front-end service. The outcomes of this work confirm the existence of such compromised devices on an Internet scale, while the generated inferences and insights are postulated to be employed for inferring other similarly compromised IoT devices, in addition to contributing to IoT cyber security situational awareness.",
              "article_number": "8466375"
            },
            {
              "title": "Secured Internet Office Network with the Internet of Things Using Packet Tracer Analysis",
              "abstract": "Internet of Things (IoT) communication provides connections of more objects and services to the Internet which involves a Secured Internet Office Network environment. Internet office is an important environment where issues on security have been regularly discussed which impact education, communication, business, government, and others. Recent small internet office network has implemented VLAN, DHCP, Cisco ASA Firewall, wireless access point and registration Server but IoT is enhanced from time to time. This paper presents the implementation of simulation of IoT onto a secured small office network by using the Cisco Packet Tracer a network simulator software. A simulation of Internet office network with IoT systems services on motion detection system, door lock system and smoke detection system were developed. Due to security concerns, several security protocols have been integrated such as SSL VPN, ASA Firewall security level and WPA2-PSK authentication. The result has successfully shown the data for smoke level over time taken and the door lock system's scenarios based on the RFID setup. The implementation of the IoT, network design and configuration and integration of the security protocols have been successfully implemented using the Cisco Packet Tracer.",
              "article_number": "9612554"
            },
            {
              "title": "Social Networks of Devices and Software Defined Networking as enabling factors for improving performance of group communications in 5G Internet of Things networks",
              "abstract": "This talk addresses an issues, deeply felt in next generation networks, concerning the management of group communications in scenarios characterized by the massive presence of Internet of Things devices acting as “prosumers” (consumer&producer) of services based on the exchange of huge data amounts. This will put a strain on existing networking primitives and their efficient management will be possible only if new paradigms are made available. Starting from this assumption, the talk will discuss the possibility of leveraging Social Networking and Software Defined Networking technologies and concepts towards the definition of a novel network primitive for the Internet of Things. The new primitive, called Sociocast, has the potential to enable trusted group-oriented communications, in-network publish&subscribe mechanisms, dynamic and selective firewalling, flexible data casting. During the talk a distributed architectural solution is presented, some performance results shown, and open research issues discussed.",
              "article_number": "8958654"
            },
            {
              "title": "Research on application and security protection of Internet of Things in Smart Grid",
              "abstract": "The Internet of Things (IoTs) has been considered one of the very promising technologies for the implementation of Smart Grid. First, main features of information and communication systems in Smart Grid are abstracted; the applications of IoTs in Smart Grid are analyzed and classified based on the different function. Then, based on the characters of smart grid systems, reference architecture for Smart Grid IoTs is introduced. Second, main security issues and information security protection requirements of Smart Gird IoTs are well studied. Considering the function of the IoTs application, IoTs in smart grid are classified into three areas with different importance, including electrical industrial control IoTs; gird information collection and process IoTs, and IoTs for power consumer interaction. And classified protection framework of internet of things security is described. The proposed framework can guide the security deployment for Smart Grid IoTs applications. Finally, trusted secure access control system for IoTs terminals is designed for the security protection of Internet of Things in Smart Grid.",
              "article_number": "6755690"
            },
            {
              "title": "Delivering security by design in the Internet of Things",
              "abstract": "End to end security is becoming a prerequisite of the Internet of Things. Data must be managed securely at generation, in flight and at rest to avoid critical enterprise or personal data being intercepted. Privacy becomes paramount as our lives and health become increasingly digital, and devices must evolve to deliver security and robustness while pricing continues to be constrained. This talk will highlight the security requirements of the IoT as outlined by the Dept. of Homeland Security and the UK Centre for Protection of National Infrastructure to counter the emergence of threats ranging from advanced persistent software threats to physical tampering and side channel attacks. Following the definition of the attack threats we will then establish the definition of advanced device security features, system implementation requirements and testability criteria to develop Security by Design within the Internet of Things.",
              "article_number": "7035283"
            },
            {
              "title": "Performance comparison IoT (Internet of things) of name data networking and Internet protocol in first media network in jakarta area",
              "abstract": "Internet of Things is a concept that aims to expand the benefits of Internet connectivity to be able to share information between devices to be further processed. An example is the streetlight control automation system, where complete information can get stored in the database for further processing. The process of exchanging or sending information from a large IoT system requires the performance of a good network condition. One way is to utilize a new network architecture method called the named data network. The use of Named Data Networking (NDN) enables the distribution of databases to each node that frequently makes requests to the main database server thereby reducing server and network loads. To be able to provide representations of IoT on the NDN network a simulation was made using ndnSIM to provide an overview of IoT performance on the NDN network using a network-based topology in Jakarta.",
              "article_number": "8284149"
            },
            {
              "title": "Impact of IoT device saturation on home WiFi networks",
              "abstract": "The number of smart home devices and their applications are increasing with little regard to the maximum capacity of the networks which are supposed to host such devices. We explore how well various consumer-grade routers perform when a multitude of IoT devices are connected and several video streams are active at once. Evaluation results demonstrate entry-level routers are not capable of handling the workload produced by IoT devices. Routers that support Multi-Input Multiple Output (MIMO) technology, and multi-band routers are recommended to compensate for these devices.",
              "article_number": "8643192"
            },
            {
              "title": "Research on Zero-Trust Based Network Security Protection for Power Internet of Things",
              "abstract": "For the new characteristics of power Internet of Things (IoT), the traditional perimeter-based security model could not satisfy the network security requirements of the power IoT. However, zero trust security model was proposed in the past decades to meet new security challenges of networks. In this paper, the technical characteristics of zero trust security architecture are studied and analyzed. The security protection technology of the power IoT based on zero trust security architecture is proposed. Through identity authentication, application agent, data encryption and other security protection technologies, a fine-grained security control of access mechanism is designed. Our propositions provide a solution and technical exploration for future security protection of the power IoT to help power enterprises build more secure network security.",
              "article_number": "9668726"
            },
            {
              "title": "Network Security Risk Investigation System Based on Internet of Things Technology",
              "abstract": "In order to overcome the security problems in the operation of Internet platform, such as user privacy leakage, this paper proposes a network security risk investigation system based on Internet of things technology. The survey system makes full use of big data technology, cloud computing technology and other high-tech, can accurately identify the potential network security problems, and try to send the existing security problems to users and relevant departments. Based on this, the survey system is also designed as a lightweight program, which can continuously identify the security risks in the network for users in the background while occupying very little memory space. The research results show that the application of the survey system can effectively and scientifically identify network security risks, so as to provide users with a good network operating environment. At the same time, this paper also emphasizes that the premise of reducing network security accidents not only requires users to fully use the network security risk survey system, but also should establish a good network security awareness.",
              "article_number": "9470277"
            },
            {
              "title": "M4DN.IoT-A Networks and Devices Management Platform for Internet of Things",
              "abstract": "Connected objects to the Internet (computers, sensors, smartphones, and smart watches) are the part of daily life and their interconnection performs the Internet of Things (IoT) vision. IoT solutions are used in various domains, such as healthcare, industry, agriculture, and cities. IoT networks are often characterized by resource-constrained devices and sometimes deployed in hard to reach areas. In addition, an IoT network landscape may include a large number of heterogeneous devices. All these factors drive the need for adapted management solutions for IoT devices and networks. In order to guarantee the better use of IoT networks, effective and automatic management is necessary. This paper studies different solutions for IoT networks and devices management identifying their characteristics and technical challenges. Important requirements like security, context-aware, and a standard model for messages exchange have not been completely explored. Thus, these most relevant features are used to propose and deploy a new IoT management platform with a friendly user's interface, called management for devices and networks in IoT (M4DN.IoT). The solution is evaluated, demonstrated, validated, and it is under use.",
              "article_number": "8681396"
            },
            {
              "title": "SSH brute force attack mitigation in Internet of Things (IoT) network : An edge device security measure",
              "abstract": "With the explosive growth of IoT applications, billions of things are now connected via edge devices and a colossal volume of data is sent over the internet. Providing security to the user data becomes crucial. The rise in zero-day attacks are a challenge in IoT scenarios. With the large scale of IoT application detection and mitigation of such attacks by the network administrators is cumbersome. The edge device Raspberry pi is remotely logged using Secure Shell (SSH) protocol in 90% of the IoT applications. The case study of SSH brute force attack on the edge device Raspberry pi is demonstrated with experimentation in the IoT networking scenario using Intrusion Detection System (IDS). The IP crawlers available on the internet are used by the attacker to obtain the IP address of the edge device. The proposed system continuously monitors traffic, analysis the log of attack patterns, detects and mitigates SSH brute attack. An attack hijacks and wastes the system resources depriving the authorized users of the resources. With the proposed IDS, we observe 25% CPU conservation, 40% power conservation and 10% memory conservation in resource utilization, as the IDS, mitigates the attack and releases the resources blocked by the attacker.",
              "article_number": "9478131"
            },
            {
              "title": "Secure Computing for the Internet of Things and Network Edges: Protecting Communication in the Worldwide Network of Devices",
              "abstract": "The Internet of Things (IoT) is focused on architectures and protocols for the efficient interconnection of heterogeneous things, deployment of infrastructure, and creation of value-added services. The IoT has become an emerging technology, where more than 50 billion things will be connected to the Internet by 2020, and data in the network will grow by another 1,000 times. The framework of the IoT is the backbone for several applications, such as smart cities and smart homes, where most of the data move to the cloud for further evaluation because of the resource poverty of IoT devices.",
              "article_number": "8482510"
            },
            {
              "title": "Industrial Internet of Things Intrusion Detection Model Integrating Graph Attention Network and Gated Temporal Convolutional Network",
              "abstract": "In recent years, the application of the Industrial Internet of Things (IIoT) in industry has become increasingly important. However, because IIoT devices and systems are connected to the Internet, they may face the risk of malicious intrusions that can cause serious damage to production processes and data security. Intrusion detection systems (IDS) can be used to monitor IIoT for malicious activities and develop response strategies. Therefore, this article proposes an intrusion detection model called GTRGAT to ensure the network security of IIoT. In particular, the GTRGAT model uses GTCN to quickly pull out sequence features from IIoT traffic. GTCN combines convolutional operations and gating mechanisms, aiming to process time series data more efficiently and capture its intrinsic patterns. By using the TON_IoT dataset, the performance of the GTRGAT model is verified, showing that it can accurately detect intrusions. The experiment also showed that the GTRGAT model works better than other advanced methods, so it can be used as a workable way to find intrusions in industrial IoT networks.",
              "article_number": "10549297"
            },
            {
              "title": "Open source implementation of Internet of Things as a Network of Intranet of Things",
              "abstract": "There is a Race to build and Enable Internet Of Things (IOT), Companies are competing each other to make IOT things as a result each device is coming with specific cloud interface and application with no capability to talk to each other. Interoperability and Internet Reliability plays a vital Role in Future Internet Enabled Devices. This paper discuss the implementation of Internet of Things as a Network of Intranet of Things which proposes method to solves the issues of Interoperability and Self Organization of IOT things using Fallback/Switch over mechanism in Intranet.",
              "article_number": "7857619"
            },
            {
              "title": "Network security protocol for constrained resource devices in Internet of things",
              "abstract": "Security protocols built on strong cryptographic algorithms to defeat attempts of pattern analysis are popular nowadays, but these algorithms consume a lot of processor's efficiency. So, devices with limited processor capabilities need some modified protocols. Billions of such devices, known as ‘smart objects’ are used in IOT (Internet of things). IOT is an interconnection of a large number of smart objects with low resources. WSN (wireless sensor network) which comprises of a large network of sensors and actuators with constrained capabilities also need resource efficient protocol to be implemented. Security, trustworthiness and privacy are major challenges to turn IOT into a reality. Absence of strong security protocols, attacks with malicious intent and malfunctions will outweigh the benefit of IOT components. Data integrity, identity management, trust management and privacy are four crucial obstacles in designing a secure IOT. To alleviate these challenges and obstacles, a security protocol that uses minimal processor capacity and facilitates targeted security benefits of IOT is proposed. This protocol counters most of security issues with existing IOT protocols and is robust against severe attacks. This protocol is unique in a way that it gives different bit-streams in a given authenticated session for same data which cannot be predicted by the transmitter itself and changes within nanoseconds. Also, a perfectly random signal to choose the bit-stream, in place of pseudo-random code algorithm is used. In V2V (vehicle to vehicle) IOT, an illustration of error correction in the key instead of lengthening the sent bit stream is also done.",
              "article_number": "7443737"
            },
            {
              "title": "The clustering of Internet, Internet of Things and social network",
              "abstract": "Information, objects and people are three major macro elements in the human society. Their inner relations can be reflected by the Internet, the Internet of Things and social network, respectively. Normally, these three networks do not work together. This paper proposes a platform to cluster the Internet, the Internet of Things and social network together. The clustering will promote the developing of the Internet of Things and social network. With the clustered platform, most macro elements in human society can be tracked and summarized. Thus it is easy for scientists to analyze the behaviors of objects and people as data. The future applications of the clustered platform are also discussed in this paper.",
              "article_number": "5646274"
            },
            {
              "title": "Communication Technologies and Challenges on 6G Networks for the Internet: Internet of Things (IoT) Based Analysis",
              "abstract": "The upcoming sixth-generation (6G) communication system is expected to deal with boundless advances compared to the existing fourth-generation (4G) communication system. The basic challenges in a 6G networking system are low latency, low energy consumption, high capacity, and high quality of experience, massive connectivity, and reliable connectivity. Thus, the 6G network will be able to provide customers a new experience of the digital virtual world with its several-fold improved performances. As sixth generation (6G) wireless communication networks will serve the service and applications via the Internet of Things (IoT), it has the possibility to ensure future intelligence. The purpose of this research article is to investigate the communication technologies and challenges on 6G networks for the internet with the cooperation of Internet of Things(IOT). Depending on a secondary data collection method the researcher has set the collection process of relevant data and information of the mentioned topic. It has helped the researcher to lead the study towards the correct direction. Similarly, the collected resources used qualitative methods to malaise the data to be understandable. Furthermore, this study will help the readers to understand the appropriate effectiveness of the ways to mitigate the challenges in the 6G network system. Implementing a sixth-generation network system can provide different advantages and challenges such as building a network that is suitable for the environment, cost-effective, supported by mobile devices, and connected with AI technology to perform more efficiently. In this paper, challenges in the implementation of the next-generation network system have been discussed and this study examines the solution that can be applied to deal with such challenges.",
              "article_number": "9753990"
            },
            {
              "title": "A strategy for deploying diverse sensor-based networks as an evolution towards integrated Internet of Things and Future Internet",
              "abstract": "Buying an off-the-shelf sensor or actuator device has become a common practice with individual developers or universities that are keen on exploring ways of flexibly building networks for increasing possibilities of use. Their objective might not be on a targeted single application or an integrated product, but by conducing trials, suitable development and research, they explore novel networking opportunities and fit them to suitable applications. Internet of Things is a concept that promises a world of interconnected IP entities to be facilitated by new underlying capabilities in the Internet. This new initiative meets the vast population of Wireless Sensor (and actuator) Networks that have been deployed in an ever-increasing ranges of applications. The paper shows an understanding of how topics can be coherently combined behind a target for developing a regional and multi-application system and grouping the research topics that would foster its further development.",
              "article_number": "7034349"
            },
            {
              "title": "Feature Selection Using Firefly Algorithm for Classification of Attacks in Routing Protocol for Low Power Lossy Networks (LLNs) Based Internet of Things (IoT) Networks",
              "abstract": "IoT(Internet of Things) is a collection of diverse resource-constrained things or nodes. All the IoT devices used to collect and share data are connected through Internet. Since all the devices are connected through Internet, it makes the devices to process more data. Standard security methods could not be applied in the devices due to a lack of sufficient resources like processing power. So, RPL is used as a routing protocol in most of the IoT networks. Due to constraint in resources, RPL is vulnerable to various attacks. In existing systems, various Machine Learning (ML) algorithms are employed to classify different IoT attacks. Since ML algorithms are linear, Deep learning (DL) algorithm is used in this work for classification of attacks. Furthermore, Feature selection approach is employed to improve the performance of the classification. Firefly algorithm is used for selecting the features in this work to remove the irrelevant features. The features that increase the accuracy of the model are only considered. The selected features are only given as input to LSTM model. From the result, it is inferred that the accuracy of Long Short Term Memory (LSTM) with feature selection algorithm is 98.53% and without feature selection algorithm is 93.25%.",
              "article_number": "10276285"
            },
            {
              "title": "A Study of Network Security Situational Awareness in Internet of Things",
              "abstract": "As the application of Internet of Things technology becomes more common, the security problems derived from it became more and more serious. Different from the traditional Internet, the security of the Internet of Things presented new features. This paper introduced the current situation of Internet of Things security, generalized the definitions of situation awareness and network security situation awareness, and finally discussed the methods of establishing security situational awareness of Internet of Things which provided some tentative solutions to the new DDoS attack caused by Internet of Things terminals.",
              "article_number": "9148549"
            },
            {
              "title": "The Integration of Connectivity and System Integrity Approaches using Internet of Things (IoT) for Enhancing Network Security",
              "abstract": "Machine learning, this same Internet of Things, and other emerging digital technologies aid in improving military uses and aid management in efficiently gathering, analysing, manipulating, and storing enormous volumes of data. Additionally, these technologies help with the storage of information that may be recovered later. However, this poses a serious risk to the organization’s ability to protect the data that is needed to properly increase the network security. It has been stated that IoT may help safeguard the organisation from various cyber-hacks, necessitating the use of various ways to raise security levels. Additionally, the expanded use of IoT improves cooperation and integration across diverse systems and processes in commercial businesses.In order to improve network security, this research is primarily concerned with identifying the critical factors that relate here to integration of connections and system integrity techniques. The scholars used both inferential and descriptive statistics to conduct the study, and it has been further recognised that all the IoT causal factors support strengthening network level of security. The paper is classified in outlining the crucial aspect on which the entity needs to concentrate when using IoT to enhance security by protecting the data.",
              "article_number": "10072475"
            },
            {
              "title": "\"bioinspired algorithms for Internet of Things network\"",
              "abstract": "The Internet of Things (IoT) has come towards its peak time which includes smart cities, smart buildings, smart homes, smart kitchens, smart appliances, security, smart home, smart health, smart factories, smart machines, smart supply chain, smart transportation, smart manufacturing, autonomous vehicles, smart consumer devices, etc. The infrastructure and management will be based on the smart systems which has sensors and crowdsourcing as information sources. The future of IoT success depends on the optimization and new approaches for application of interfaces, allocation of behaviours, evolution of technology, and system security. IoT success will only be realized through major development of systems engineering processes and tools that will be able to overcome the challenges of IoT Network. This talk will discuss some state of the art bioinspired researches for communication technology in IoT Network as an example of systems engineering. We will discuss computational iterative optimization which introduced bio-inspired algorithms, which is inspired by living creature organisms. We will discuss some example learned from the intelligence of living organism in nature. Bioinspired algorithm taxonomy such evolution, swarm, ecology, network, immune to overcome challenges such as resource constraint, scalability, heterogeneity, mobility and security will be discussed. The optimization techniques used in Research in Network protocol from conventional, mathematical programming to bio-inspired metaheuristic approaches which lead to heuristic, robust, low complexity, parallel structure will be exposed in this presentation. We will also discuss bioinspired algorithm application for network deployment, clustering, routing and security.",
              "article_number": "8257662"
            }
          ]
    },
    {
        "id": 3,
        "query": "((( literature  OR document OR information OR data ) AND (retrieval OR retrieve)) OR (search AND engine)  )  AND  (query AND  ( expansion OR refinement OR reformulation))",
        "documents": [
            {
              "title": "Information Retrieval in Search Engines Using Pseudo Relevance Feedback Mechanism",
              "abstract": "Online data generation is increasing rapidly due to technological development. In order to handle the huge volume of data, big data methodology is used widely. Though big data can able to process huge data, it has its own issues including information storage, data management, and retrieving data. In big data, data retrieval is an issue where the method of data retrieval and implementation environment differs. Though data mining has become evolving technology, it requires an optimal retrieval mechanism to extract data from the hugerepository.Therefore, an information retrieval method which in turn should effectively perform data retrieval in terms of both speed and accuracy need to be implemented. Topic relevance mechanism is used to retrieve an appropriate document from the repository, these documents are then ranked based on user preference using pseudo-relevance feedback mechanism. And hence the accuracy of the retrieved document is improved.",
              "article_number": "8899424"
            },
            {
              "title": "An Improved Sentence Embeddings based Information Retrieval Technique using Query Reformulation",
              "abstract": "Information retrieval (IR) is a field of study that focuses on gathering, organizing, storing, analyzing, and accessing information. It is used in all applications where searching for information is required through the internet. Selection and ranking of relevant web documents to satisfy users’ information need in response to users’ queries is the most important task associated with IR. To better comprehend the user’s intent and create a more efficient query, the initial query has been reformulated by adding new terms. The semantic text-similarity techniques proposed by researchers in the past demand a significant amount of trained labeled data as well as user intervention; both of them are scarce, hard to capture, and difficult to maintain. In general, these techniques ignored contextual information as well as word order, which causes the problems like data sparsity and latitudinal explosion. Deep learning techniques are now being utilized to find text similarities. Various sentence embedding models exist today that can use vectors to represent complete sentences and their semantics. This helps the search engine to comprehend the context, intent, and different aspects of the user text. So, in this paper, a sentence embedding model based query reformulation (QR) has been proposed for improving document ranking performance using a universal sentence encoder (USE) and a cosine similarity measure. Four standard datasets CACM, CISI, ADI, and Medline are used to perform all the experiments. The outcomes demonstrate the superior performance of the USE-based QR system over the SBERT sentence embedding model by 4.48 %, 5.97%, and 7.2% and 2.1% for ADI, CISI, CACM, and Medline datasets respectively.",
              "article_number": "10141788"
            },
            {
              "title": "Using Query Reformulation to Compare Learning Behaviors in Web Search Engines",
              "abstract": "Web search engines have gained importance as tools capable of connecting informal and self-learning with formal learning by aiding individuals in retrieving relevant information through the formulation and modification of their queries. Understand the differences between query states and their transitions becomes increasingly important, as doing so makes the optimization of search engines' results according to educational uses and needs possible. This paper introduces the ESKiP Taxonomy of Query States, a classification framework validated in an experiment involving two different query log datasets. It enables the comparison between the behaviors of users in search for knowledge (learners) and users performing transactional or factual searches in Web search engines.",
              "article_number": "8820932"
            },
            {
              "title": "Combining Parts of Speech, Term Proximity, and Query Expansion for Document Retrieval",
              "abstract": "Document retrieval systems recover documents from a database and order them according to their perceived relevance to a user's search query. This is a difficult task for machines to accomplish because there exists a semantic gap between the meaning of the terms in a user's literal query and a user's true intentions. The main goal of this study is to modify the Okapi BM25 document retrieval system to improve search results for textual queries and unstructured, textual corpora. This research hypothesizes that Okapi BM25 is not taking full advantage of the structure of text inside documents. This structure holds valuable semantic information that can be used to increase the model's accuracy. Modifications that account for a term's part of speech, the proximity between a pair of related terms, the proximity of a term with respect to its location in a document, and query expansion are used to augment Okapi BM25. The study resulted in 87 modifications which were all validated using open source corpora. The top scoring modification from the validation set was then tested under the Lisa corpus and the model performed 10.25% better than Okapi BM25 when evaluated under mean average precision.",
              "article_number": "8665507"
            },
            {
              "title": "Information Retrieval based Improvising Search using Automatic Query Expansion",
              "abstract": "Current search engines like Google, Yahoo give the search results, indeed users are facing problems in information retrieval. The main problem is because of word mismatch and availability of many resources. Petabytes of information is available because of Internet. From that huge available data, for a naïve user it becomes hectic to distinguish between relevant and irrelevant information to individual interest. Also, another reason of getting irrelevant information is incompatibility between terms that users are using and keywords present in documents. Query expansion is an adding keyword to the original query. The main issue in query expansion is selection of appropriate terms from user's original query. Vocabulary database helps to solve this issue. Identification of the similar words and language entities that are similar in meaning is done by vocabulary which is frequently incorporated in information retrieval system. Thesaurus has been used across a large area of in information retrieval also many applications and natural language processing. In this work, to improve performance of a search query, BM25 model is used for query expansion. Cosine similarity is used to determine similarity between two keywords. Rocchio algorithm is used to calculate the relevance feedback. Experimental result shows better results using Rocchio algorithm.",
              "article_number": "9388573"
            },
            {
              "title": "Query Expansion for Bangla Search Engine Pipilika",
              "abstract": "Query expansion aims to extend the user query with related terms for improving the search results of a search engine like Google, Pipilika (a Bangla search engine), etc. In this paper, a query expansion method has been proposed for Pipilika to select expanded words that will be added with a search key to make the search result more accurate and efficient. Collected documents from corpus data have been ranked using BM25 document ranking method. The method selects additional words from ranked documents that have top syntagmatic relations with the search key. It generates similar words for each additional word and searches keywords using Word2Vec CBOW model which has a more semantic similarity with original words. It adds these similar words with search key and additional words. Finally, an expanded query will be generated. This can help the search engine to capture more user requirements for better search results. The calculated F1 score of the method is 0.74.",
              "article_number": "9231043"
            },
            {
              "title": "Query Reformulation for Task-Oriented Web Searches",
              "abstract": "Web searches are driven by information needs and intend the accomplishment of specific tasks. Information needs are determined by the topical subject of queries, i.e. what we search, while tasks are determined by the user motives that induce the submission of queries, i.e. why we search. Though there exist numerous studies on how to assist searchers specify queries that are expressive of their underlying information needs, little has been done to help searchers specify queries that describe the tasks they pursue via their searches. In this paper we propose a query reformulation method to empower task-oriented web searches. Given a query, our method starts with the identification of terms that could serve as descriptors of the potential search tasks the query represents. Based on the identified terms, it generates query re-formulations that explicitly verbalize the possible search tasks. Query reformulations are presented to the user in order to select the one that best suits her search intention.",
              "article_number": "6040862"
            },
            {
              "title": "Query Expansion in Information Retrieval for Urdu Language",
              "abstract": "The information retrieval system need to be upgraded constantly to meet the challenges posed by the advanced user queries as the search system becoming more sophisticated with time. These problems have been addressed extensively in recent times in several research communities to achieve quick and relevant outcome. One such approach is to augment the query where the automatic query expansion increases the precision in information retrieval even if it can cut down the results for some queries. Here, the above approach was tested with the present Urdu data collection obtained via different expansion models such as KL, Bo1 and Bo2. The current collection is quite large in size compared to other existing Urdu datasets. It comprises of 85,304 documents in a TRECschemes and 52 topics with their relevance assessment. In this paper we emphasize to enhance the retrieval model using the query expansion which is never done before on Urdu text. However, we show that a deep analysis of initial and expanded queries brings fascinating insights that could avail future research in the domain.",
              "article_number": "8464762"
            },
            {
              "title": "Research on Semantic Query Expansion with Temporal Information",
              "abstract": "The temporal information is an essential attribute in the web page, such as the publish time and the content time in the web page. However, the major search engine does not have more view on the temporal information of web page, and ignored the relationship between the keywords and time phrases. In this paper, we focus on the need in time phrases recognizing and extracting from the web page. We built a query expansion model based on temporal information. The experiment results showed that the user queries based on temporal information is better than the simple semantic query expansion in the capabilities of query expression and query procession.",
              "article_number": "7120642"
            },
            {
              "title": "A collaborative search with query expansion and result re-ranking",
              "abstract": "Web Search Engines have become a resource pool for the people to gain information. They always aim at achieving the goal of delivering relevant information to the users. Due to the exponential growth of information and imprecise queries, Search engines could not meet the user's information requirements. Users have to reframe their queries until they get their desired information. Also results are not listed based on the users search context. Personalization is re-ordering of the search results that satisfies the needs of the user. This paper presents an approach to capture the user's preferences in order to provide query suggestions. Web search personalization using collaborative filtering adapts a generic search engine for the needs of a community of users. The main objective of this work is to improve the retrieval of information by expanding the user query and to rank the result list based on the users domain of interest.",
              "article_number": "6141382"
            },
            {
              "title": "Query reformulation using WordNet and genetic algorithm",
              "abstract": "Search on the web is a delay process and it can be hard task especially for beginners when they attempt to use a keyword query language. Beginner (inexpert) searchers commonly attempt to find information with ambiguous queries. These ambiguous queries make the search engine returns irrelevant results. This work aims to get more relevant pages to query through query reformulation and expanding search space. The proposed system has three basic parts WordNet, Google search engine and Genetic Algorithm. Every part has a special task. The system uses WordNet to remove ambiguity from queries by displaying the meaning of every keyword in user query and selecting the proper meaning for keywords. The system obtains synonym for every keyword from WordNet and generates query list. Genetic algorithm is used to create generation for every query in query list. Every query in system is navigated using Google search engine to obtain results from group of documents on the Web. The system has been tested on number of ambiguous queries and it has obtained more relevant URL to user query especially when the query has one keyword. The results are promising and therefore open further research directions.",
              "article_number": "7976138"
            },
            {
              "title": "Query reformulation using ontology and keyword for durian web search",
              "abstract": "Query reformulation techniques based on ontological approach have been studied as a method to improve retrieval effectiveness. However, the evaluation of this techniques has primarily focused on comparing the technique with ontology and without ontology. The aim of this paper is to present, evaluate and compare the proposed technique in four different possibilities of reformulation. In this study we propose the combination of ontology terms and keywords from the query to reformulate new queries. The experimental result shows that reformulation using ontology terms alone has increases recall and decreases precision. However, better results were obtained when the ontology terms being combined with the query's keywords.",
              "article_number": "7806342"
            },
            {
              "title": "Enhancing Thematic Holy Quran Verse Retrieval through Vector Space Model and Query Expansion for Effective Query Answering",
              "abstract": "The Quran provides valuable insights into various aspects of life, including information about the natural world, such as animals and plants. Developing an information retrieval system can greatly facilitate the search for specific content within the Quran. This system utilizes a cosine similarity approach and query expansion techniques to rank and expand the retrieved documents according to the user's needs. In this research, the Term Frequency-Inverse Document Frequency (TF-IDF) weighting method is employed, following preprocessing steps for both the documents and queries. The primary objectives of this study are to assess accuracy, precision, and recall values. Notably, the inclusion of query expansion has led to an improved recall value compared to previous research, resulting in a 99.32% accuracy rate, a 5.83% increase in precision (from 83.93%), and a system's ability to capture 8.75% of the relevant verse (compared to the previous 93.51%). This signifies that all verses can be invoked, displayed, or expanded, providing a more comprehensive query experience.",
              "article_number": "10420387"
            },
            {
              "title": "Combining Query Reformulation and Re-ranking to Improve Query Expansion in Chinese EMR Retrieval",
              "abstract": "The methods of query expansion (QE) have achieved significant performance in information retrieval of electronic medical records (EMR). It is a pity that the direct addition of expansion terms may cause query drift, which decreases the precision of EMR retrieval. To solve the issue, we combine the methods of query reformulation and re-ranking to improve the performance of QE in Chinese EMR retrieval. First, the synonyms and hyponyms are extracted from a Chinese medical knowledge graph as expansion terms, and the weights of expansion terms are calculated with the combination of semantic similarities, category weights, and co-occurrence frequencies. Then the query is reformulated by these expansion terms, and the EMR documents are retrieved by the expanded query. Second, four categories of medical terms in top retrieval results are selected, and the performances of all combinations in re-ranking are tested to select the most proper terms for re-ranking. Then the original retrieval results are re-ranked by these terms. Experiments show that the algorithm can promote the effectiveness of EMR retrieval compared with baselines, which shows that the combination of query reformulation and re-ranking can differentiate expansion terms of different categories and maximize their effects.",
              "article_number": "9669713"
            },
            {
              "title": "Tuning topical queries for effective information retrieval",
              "abstract": "How anyone can find the desired bit of information with respect to his/her own context from the ocean of information resided in multiple databases and text repositories growing at an enormous rate. Information retrieval systems (IRS) are use to find information as output with respect to the user query as input. Effectiveness of information retrieval system hugely depends upon the query formation. Various factors affecting query formation are media expertise, domain expertise and type of search [1, 2]. Search engines are necessary tools for information retrieval from World Wide Web. Conventional search engines like Google, Yahoo etc. have huge amount of data. To retrieve the information from these conventional search engines which serve the population on the whole without much concerning about user context require user query expressive enough about user context and need. In our paper we have proposed a model to build a context based search engine on the conventional search engine using genetic algorithm. We have tried to find out good query terms in context of user to find user specific retrieval. We have used these terms for query expansion or reformulation.",
              "article_number": "6108983"
            },
            {
              "title": "Assisting code search with automatic Query Reformulation for bug localization",
              "abstract": "Source code retrieval plays an important role in many software engineering tasks. However, designing a query that can accurately retrieve the relevant software artifacts can be challenging for developers as it requires a certain level of knowledge and experience regarding the code base. This paper demonstrates how the difficulty of designing a proper query can be alleviated through automatic Query Reformulation (QR) - an under-the-hood operation for reformulating a user's query with no additional input from the user. The proposed QR framework works by enriching a user's search query with certain specific additional terms drawn from the highest-ranked artifacts retrieved in response to the initial query. The important point here is that these additional terms injected into a query are those that are deemed to be “close” to the original query terms in the source code on the basis of positional proximity. This similarity metric is based on the notion that terms that deal with the same concepts in source code are usually proximal to one another in the same files. We demonstrate the superiority of our QR framework in relation to the QR frameworks well-known in the natural language document retrieval by showing significant improvements in bug localization performance for two large software projects using more than 4,000 queries.",
              "article_number": "6624044"
            },
            {
              "title": "Improving search engine query expansion using clustering and indexing based approach",
              "abstract": "In old days, people have become conscious about the consequences of archiving and finding information. With the arrival of computers, it became possible to store huge amount of information; and finding the useful information from images collections which is became a necessity. Out of this necessity in the 1950s, the field of Information Retrieval (IR) was born. The field of information retrieval has matured considerably over the last forty years. Query expansion main objective is to extend the user query with related terms to improvise the search results. It is done to improve the relevance of the documents which are retrieved by the IR systems. In this paper, we propose a Cluster and Indexing based approach for query expansion. We also presents that our proposed mechanism produces better recall and precision.",
              "article_number": "8392032"
            },
            {
              "title": "Interactive system based on web search results clustering for Arabic query reformulation",
              "abstract": "The main goal of this work is to propose an Interactive System for Arabic Web Search Results Clustering ISAWSRC that may be used as helpful tool for Arabic Query Reformulation. This latter is an enhanced version of our published system called AWSRC for Arabic Web Search Results Clustering. Using this proposed interactive system, the user can decide at a glance whether the contents of a cluster are of interest: He/She does not have to reformulate the query, but can merely click on the produced cluster label most accurately describing his or her specific information need in the topic hierarchy. Therefore, the user can navigate in the sense of generalization or specification based on these cluster labels. To illustrate the efficiency and to evaluate the performance of our proposition, several experiments have been conducted. The obtained results show that: on the one hand the quality of the cluster labels is very high and can help user to reformulate his/ her queries, and on the other hand the generated topics hierarchy allow the user the possibility to navigate the sense of generalization and/or specialization without need of query reformulation.",
              "article_number": "7016636"
            },
            {
              "title": "An approach for semantic query expansion based on maximum entropy-hidden Markov model",
              "abstract": "The ineffectiveness of information retrieval systems is mostly caused by the inaccurate query formed by a few keywords that reflect actual user information need. One well known technique to overcome this limitation is Automatic Query Expansion (AQE), whereby the user's original query is improved by adding new features with a related meaning. It has long been accepted that capturing term associations is a vital part of information retrieval. It is therefore mainly to consider whether many sources of support may be combined to forecast term relations more precisely. This is mainly significant when frustrating to predict the probability of relevance of a set of terms given a query, which may involve both lexical and semantic relations between the terms. This paper presents a approach to expand the user query using three level domain model such as conceptual level(underlying Domain knowledge), linguistic level(term vocabulary based on Wordnet), stochastic model ME-HMM2 which combines (HMM (Hidden Markov Model and Maximum Entropy(ME) models) stores the mapping between such levels, taking into account the linguistic context of words.",
              "article_number": "6726755"
            },
            {
              "title": "A survey of query log processing techniques and evaluation of web query intent identification",
              "abstract": "Query log is the pouch of valuable information that records user's search queries and related actions on the internet. By mining the recorded information, it is possible to exploit the user's underlying goals, preferences, interests, search behaviors and implicit feedback. The wealth of mined information can be used in many applications such as query log analysis, query recommendation, query reformulation, query intent identification and many more to improve performance of search engine by providing more relevant results. Over the past decade, there has been tremendous work done for improving search engine results to flourish the users for searching. This paper reviews and compares some of the available methods to give an insight into the area of query log processing for information retrieval. Our approach classifies web query intent based on knowledge extraction from query log analysis.",
              "article_number": "6514421"
            },
            {
              "title": "Learning to Rank for Biomedical Information Retrieval",
              "abstract": "With the continuous development of biomedical, the scale of data has also continued to increase, which makes it difficult for researchers to extract information manually. In order to satisfy the researcher's information requirement, information retrieval techniques for the biomedical field have been resolved. Learning to rank is the field of machine learning and information retrieval combination, it has been shown to improve the retrieval efficiency to a large extent. This paper proposes a query optimization technology based on learning to rank. By using learning to rank for technical research on optimizing, a model combining query improvement and query expansion is proposed. Based on the improvement of the query, our method uses LTR to reorder the query expansion words, so that the original query can retrieve the document with higher accuracy. Only by biological field resources, the query expansion can obtain extended words, but it can not accurately describe the degree of relevance between extended words and query words. Introduce LTR methods can fully consider the relevance of extended words and original queries. Improve the inaccurate problem of single-extension. The experimental results show that compared with traditional algorithms, this algorithm improves retrieval efficiency by 3.31% on average.",
              "article_number": "9526006"
            },
            {
              "title": "Utilising Creative Computing and data mining techniques to analyse queries in a meta-search system",
              "abstract": "As the World Wide Web has a huge number of information and update rapidly, the needs of people for searching information from the web increase dramatically. Meanwhile, most of current search engines can search a query from websites, but cannot present the most relevant results to users. The main challenge for search engines and meta search engines are how to describe and analyse a query more comprehensively. In order to solve this problem, this paper presents a meta-search engine named Personlised Meta Search Engine (PMSE) that has been used to adapt the web search processes to meet users' requirement. Firstly, a technique will enrich the given query by data mining and creative computing. Secondly, a new meta-search engine is developed to make the results more relevant. Finally, an example is used to demonstrate what the proposed approach will be described more comprehensively and to produce fewer but more precise answers to individual users.",
              "article_number": "7604953"
            },
            {
              "title": "A survey of query expansion, query suggestion and query refinement techniques",
              "abstract": "The ineffectiveness of information retrieval systems often caused by the inaccurate use of keywords in a query. In order to solve the ineffectiveness problem in information retrieval systems, many solutions have been proposed over the years. The most common techniques are revolving around query modification techniques such as query expansion, query refinement, etc. Due to the high similarity in these query modification techniques, people are often confused about their differences. However, few existing survey papers compare their differences. Hence, in this paper, we first briefly discuss the basic technique of query expansion, query suggestion and query refinement, and then make a detailed comparison between these three techniques. We finally show the promising future research trend in the field of query modification.",
              "article_number": "7333094"
            },
            {
              "title": "Improve Diversity-oriented Biomedical Information Retrieval using Supervised Query Expansion",
              "abstract": "In the paper, we propose a novel diversity-oriented biomedical information retrieval method based on supervised query expansion. Our method aims to obtain the most relevant and diversified terms to enrich user queries for better interpreting the information needs. We first propose a diversity-oriented labeling strategy to annotate the usefulness of candidate expansion terms. We then extract both the context-based and resource-based term features to represent terms as feature vectors. In model training, we propose a diversity-oriented group sampling method to modify the loss function of learning-to-rank for accurate biomedical term ranking. Experimental results on TREC Genomics datasets show that our method is effective in improving the performance of biomedical information retrieval in terms of both the relevance and the diversity.",
              "article_number": "8621577"
            },
            {
              "title": "Influences on Query Reformulation in Collaborative Web Search",
              "abstract": "Past analysis has considered query reformulation primarily from the perspective of individual Web searches. Findings from a recent study suggest ways that collaboration during the search process influences how users generate new terms for query reformulation.",
              "article_number": "6766167"
            },
            {
              "title": "Query Reformulation Using Crop Characteristic in Specific Domain Search",
              "abstract": "Retrieving relevant information from Web is a challenging task. This is due to the size and rapid growth of the Web content. The existence of great search engine such as Google or Bing has simplified our searching mission. But those search engines are only efficient if the user submit query that precisely represent the user's search intent to the system. The fact is users are bad in translating their search intent into a query format for the search system to process. Therefore, users reformulate their query several times for getting more relevant results. The aim of this paper is to present evaluation of seven distinct techniques employed in query reformulation process. This work proposes the use of crop characteristic category element in reformulating query, as well as combination with ontology and query keyword elements. The experimental results show that the use of crop characteristic category in reformulating query has significantly improved the search results performance. In the future, it also can be used to replace the ontology element if the ontology is not available.",
              "article_number": "7579855"
            },
            {
              "title": "Probabilistic Query Expansion method using recommended past user queries",
              "abstract": "A plenty of Query Expansion techniques have been proposed to solve the problems of information retrieval systems, but new challenges has been introduced for these methods of expansion of user queries because of the rapid growth of the size of the Web collection. In this paper we have focused our attention on the improvement of the precision of the user query by a Probabilistic Query Expansion Method. Our approach consists on the use of information contained in query logs, which includes past user queries and their clicked documents, for providing high-level recommendations. The experiment results shows that the precision of the short queries increases even if we add a few terms, but the same number of terms added don't affect the long queries precision as much as for the short queries.",
              "article_number": "6457806"
            },
            {
              "title": "Automatic Synonym Extraction and Context-based Query Reformulation for Points-of-Interest Search",
              "abstract": "In modern search engines, synonyms are widely used for query reformulation to improve search recall and relevance. The search query is reformulated based on the synonymous terms that are semantically related to the original query. The reformulated queries are used for improving or augmenting the original query to retrieve more relevant results. However, there are four main challenges in production environments: (1) How to obtain high-quality synonyms and validate their effectiveness, especially for low-resource languagesƒ (2) How to prevent search intent drift caused by over-reformulating the correct queryƒ (3) How to efficiently keep the synonyms and models up-to-date for large-scale production systemsƒ (4) How to ensure the latency introduced by query reformulation does not affect user’s search experienceƒ In this paper, we address these challenges by introducing a context-based query reformulation system for Points-of-Interest (POI) search based on the synonyms automatically extracted from search logs and language models. The synonyms are automatically validated using historical query samples. We also propose a lightweight term identification model to prevent over-reformulation by considering query context during reformulation. The proposed methods are unsupervised/self-supervised that can be easily applied to large-scale production systems. We deploy our system to eight Southeast Asia countries that have both English and low-resource languages. Both offline evaluations and online A/B tests show that our system enhances search recall and relevance significantly.",
              "article_number": "10184885"
            },
            {
              "title": "Domain ontology based semantic search for efficient information retrieval through automatic query expansion",
              "abstract": "To achieve semantic search, a search engine is needed which can interpret the meaning of a user's query and the relations among the concepts that a document contains with respect to a particular domain. We are presenting the skeleton of such a system based on ontology. In this system, a user enters a query from which the meaningful concepts are extracted; using these concepts and domain ontology, query expansion is performed. For all the terms (expanded and initial query terms), SPARQL query is built and then it is fired on the knowledge base that finds appropriate RDF triples in knowledge Base. Web documents relevant to the requested concepts and individuals specified in these triples are then retrieved. Finally, the retrieved documents are ranked according to their relevance to the user's query and then are sent to the user. If a user wants to find specific information; can search with another module of our system that works without query expansion. The approach of query expansion makes use of query concepts as well as synonyms of these concepts and the new terms relate with the original query terms within a threshold.",
              "article_number": "6526942"
            },
            {
              "title": "Improving Query Expansion Performances with Pseudo Relevance Feedback and Wu-Palmer Similarity on Cross Language Information Retrieval",
              "abstract": "With more information available in multiple languages, the need to search for relevant information is no longer fixated only on one language. Cross language information retrieval, a system that search for relevant information in different language, experienced a decrease in performance due to the loss of meanings during translation process or the initial query that was not descriptive of the information to be sought. One method to improve the performance of the information retrieval system relevance feedback query expansion. Another method utilizes external resources such as WordNet as the basis for generating query expansion term. This study utilizes the Wu-Palmer semantic similarity measurement in WordNet to improve the performance of pseudo relevance feedback query expansion. The terms contained in the feedback document considered as candidate expansion terms. Each candidate is given weight based on IDF score, Wu-Palmer similarity score, and document score using Okapi ranking function. Several candidate terms with the highest weight are used in query expansion. Experiment is conducted by comparing mean average precision value of query expansion based Rocchio feedback with query expansion based Wu-Palmer semantic similarity using NPL collection. The result show that the query expansion method of pseudo relevance feedback with WuPalmer semantic similarity can have better performance than the Rocchio pseudo relevance feedback for document feedback less than five. The highest mean average precision is obtained when two document feedback and ten expansion term is used with 0.5605 compared to Rocchio pseudo relevance feedback with only 0.4499.",
              "article_number": "9932984"
            },
            {
              "title": "Personalized Query Expansion based on phrases semantic similarity",
              "abstract": "As a result of the rapid advancements in Information Technology, Information Retrieval on Internet is gaining importance, day by day. The web comprises of huge amount of data and search engines provide an efficient way to help navigate the web and get the relevant information. General search engines, however, return query results without considering user's intention behind the query. Personalized Web search is carried out for information retrieval for each user incorporating his/her interests. This paper presents a Personalized Query Expansion system which aims to provide relevant results by taking user interests into account. User profile is generated without user interaction i.e. automatically monitoring users browsing habits. The proposed method tries to construct query phrases considering user's real requirement based on semantic similarity which will further help in retrieving efficient search results. Experimental results show that the proposed algorithm can provide more precision than the traditional query expansion methods and hence reduces the computational time.",
              "article_number": "5941902"
            },
            {
              "title": "Selective collection enrichment in user-centred health information retrieval",
              "abstract": "Due to the increasing amount of electronic information, a majority of laypeople (ordinary people with no professional medical knowledge) now rely on the Web to seek for health information for self-diagnosis. However, research has shown that current search engines are failing to deliver effective search results due to the inability of laypeople to formulate good queries because of lack of domain knowledge and unfamiliarity with the medical vocabulary and concepts. This article attempts to address this by proposing a Selective Collection Enrichment approach that uses three different external resources to enrich a user query, thus generating three different expanded queries. In addition, we deploy pre-retrieval query performance predictors to select an expanded query that is most likely to perform better when retrieving on a local collection being searched. Furthermore, we evaluate the effects of combining several pre-retrieval query performance predictors' scores using data fusion techniques for Selective Collection Enrichment. Our empirical evaluation shows marked improvement in the retrieval performance in terms of nDCG@10 when the Selective Collection Enrichment approach is deployed.",
              "article_number": "8016195"
            },
            {
              "title": "Query expansion in XML information retrieval: A new approach for terms selection",
              "abstract": "Query Expansion is an important component for information retrieval systems. It makes possible the reformulation of the initial user query by adding new terms. In this paper, we propose a new approach for term selection in the relevance feedback process. This approach, based on Rocchio formula, is an adaptation to the XML information retrieval context. It can resolve two major problems specific to the XML information retrieval: the overlapping problem in the list of retrieved elements; and the problem of inclusion of irrelevant elements in the selection of new query terms.",
              "article_number": "7152208"
            },
            {
              "title": "Query Expansion for Information Retrieval using Word Embeddings: A Comparative Study",
              "abstract": "Internet in today's times is the daily need of people. To retrieve right information efficiently is the constant desire. Expanding user queries by transforming some keywords to retrieve specific domain keywords has been a probable solution for information retrieval. Various methods have been combined with query expansion from time to time to improve the information retrieval results right from Classical IR methods to semantic methods or to natural language processing methods. All the methods have eventually minimized the mismatch problems and gave better retrieval results. This paper discusses the performance of various such methods that can be implemented to expand user query such that it gives high precision search results. The paper mainly focuses on word embeddings methods like Word2Vec - CBOW or Skip gram and Glove that are trained on real estate related legal datasets over classical methods. Experimental results show that word embeddings give better results with 87% mean average precision (mAP) values on all datasets.",
              "article_number": "9988667"
            },
            {
              "title": "Query Expansion Framework Leveraging Clinical Diagnosis Information Ontology",
              "abstract": "The explosive growth of biomedical literature has made it difficult for biomedical scientists to locate precise articles and keep them up to date with the latest knowledge. In biomedical literature retrieval, the heterogeneity of medical terminologies and jargons suffer from query mismatch (QM). The query expansion approaches significantly improve query mismatch by incorporating and re-weighting additional similar terms in the original query. The reliance on medical ontologies to alleviate QM has garnered significant attention in biomedical literature retrieval. However, sole reliance on these ontologies is not sufficient to retrieve relevant results. Considering the foregoing statement, in this article, we design and implement a fusion query expansion framework by integrating the combination of clinical diagnosis information (CDI) and medical ontology (MO); to improve the query mismatch problem. In the proposed system, we have explored the top three MOs (MeSH, UMLS, SNOMEDCT) to select candidate expansion terms. The outcomes of the ontologies are then integrated, with clinical diagnosis information predicted by the unstructured knowledge bases to get the best query combination leading to more focused BLR. The experimental results procured on Text REtrieval Conference (TREC) Clinical Decision Support (CDS) dataset show that this fusion QE framework performed significantly better when CDI and MeSH ontology used jointly to retrieve articles. Furthermore, our results demonstrate the notable ability of the proposed framework to help search engines to improve QM in biomedical literature retrieval. We expect our proposed approach would assist investigators to use this query combination to retrieve relevant articles.",
              "article_number": "9299028"
            },
            {
              "title": "Superiority of agent based search in advanced educational technology",
              "abstract": "Traditional search systems provide users with a starting point for their information search. Information Retrieval (IR) Systems present only initial results list. The relevance measure of documents and understanding user's queries are main issues in design of IR Systems. This involves improvements at query level and result display level. Personalized retrieval widens the notion of information need to comprise implicit user needs, not directly conveyed by the user in terms of explicit information requests. This can be achieved by expanding the user query and processing the results according to the user needs. Individual pages are retrieved by the traditional IR systems even though the information is spread across multiple pages. Instead composed pages are generated which contains all the query words. Ranking of retrieved pages can be improved by providing composed pages for the given query. As Agents can provide autonomous functioning, they can be used in the design of query expansion, searching and ranking of documents. This paper proposes a multi agent-based intelligent retrieval framework for query expansion and composing of pages.",
              "article_number": "6208659"
            },
            {
              "title": "Soft Computing Techniques Based Automatic Query Expansion Approach for Improving Document Retrieval",
              "abstract": "Automatic Query Expansion provides most suitable terms for retrieving relevant documents from datasets. In this paper, a new query expansion approach is proposed and implemented which is based on accelerated particle swarm optimization(PSO). Focus of the proposed technique is to find the most suitable expanded query in place of related expansion terms. The proposed technique uses Fuzzy logic to enhance the accuracy of accelerated particle swarm optimization with changing different parameters. The proposed technique is compared with another state of the art work on different performance parameters such as F-measure and Mean Average Precision. The efficiency of the proposed algorithm technique is also evaluated on two datasets as CACM and CISI. The results indicate that the proposed technique shows improved results compared to existing similar existing technique.",
              "article_number": "8701319"
            },
            {
              "title": "Using Personalization to Improve XML Retrieval",
              "abstract": "As the amount of information increases every day and the users normally formulate short and ambiguous queries, personalized search techniques are becoming almost a must. Using the information about the user stored in a user profile, these techniques retrieve results that are closer to the user preferences. On the other hand, the information is being stored more and more in an semi-structured way, and XML has emerged as a standard for representing and exchanging this type of data. XML search allows a higher retrieval effectiveness, due to its ability to retrieve and to show the user specific parts of the documents instead of the full document. In this paper we propose several personalization techniques in the context of XML retrieval. We try to combine the different approaches where personalization may be applied: query reformulation, re-ranking of results and retrieval model modification. The experimental results obtained from a user study using a parliamentary document collection support the validity of our approach.",
              "article_number": "6514872"
            },
            {
              "title": "A context aware approach to semantic query expansion",
              "abstract": "Keyword based search scheme imposes the problem of representing a lot of web pages in the search engines. Query expansion with relevant words increases the performance of search engines, but finding and using the relevant words is an open problem. In this research we describe a new model for query expansion which employs user context and semantic concepts to discover new words for obtaining accurate results. Experimental results show an enhancement on information retrieval performance comparing to the traditional approaches.",
              "article_number": "5893868"
            },
            {
              "title": "A search log sparseness oriented query expansion method",
              "abstract": "Query expansion methods based on search logs could improve the quality of search results to some extends. But when the search logs are sparse, this kind of query expansion methods will have poor quality of search results and are unable to meet the user's search request, etc. This paper presents the search log sparseness oriented query extension method. By introducing the determination rule of data sparseness, this method selects expansion terms with high performance from the expansion terms given by local context based methods to go over the disadvantages of search log based method with sparse data sets, providing expansion terms with higher quality for the user's initial queries. The experimental results show that, this method improves the accuracy and recall of the search results, improving the quality of search results.",
              "article_number": "7009440"
            },
            {
              "title": "Selecting Good Expansion Terms for Improving XML Retrieval Performance",
              "abstract": "In this paper, we study how to perform XML query expansion effectively from the high quality pseudo-relevance documents. A solution for selecting good expansion information is presented, in which various features impacting weight, such as term element frequency, term inverse element frequency, semantic weight of tag and level information, are analyzed and those term with high weigh value are selected as expansion term. Experiment results show that proposed expansion method is feasible. Compared to original query and traditional expansion method with no structure features considered, our method achieves better retrieval performance.",
              "article_number": "6414060"
            },
            {
              "title": "Information retrieval experiment on subjective words query expansion",
              "abstract": "For information retrieval systems, the quality of searching is most important. There are many techniques to improve the quality of search, the query expansion (QE) is considered in order to improve the search result in terms of recall and user satisfaction. This paper proposed the query expansion technique using keyword-based query. These semantic terms are added to the original query in order to reformulate query before sending to the searching process. The experiments were tested on twitter data collection which class is annotated by human. The results show that the retrieval effectiveness is considerably higher than using only original query. Compared to the base-line system, this method provides higher performance in terms of recall and precision.",
              "article_number": "6574566"
            },
            {
              "title": "Applying Arabic Stemming Using Query Expansion",
              "abstract": "The process of conflating different Arabic word formats to their stem or root is called stemming. Indexing text collection using stems or roots has been reported to be superior to using original word formats. However, the Arabic text stemming has negative effects on words. It conflates words with different meaning under one index term. This occurs frequently in Arabic when using stems and it becomes more frequent when choosing roots to index the collection. Furthermore, search engine whose index is constructed using a particular stemmer makes it a stemmer-dependent engine. In this paper, we show how we can still use stemming to reach the same results without indexing the stemmed text. Original words have been indexed, and a stemmer used to extract word variants and add them to the user query. Apart from making our search operation stemmer-independent, we proof that our approach is as good as light stemming and is significantly better than root stemming.",
              "article_number": "7406310"
            },
            {
              "title": "Enhancing Video Retrieval: A User Behavior-Based Query Expansion Approach",
              "abstract": "In this study, we propose a user behavior-based query optimization strategy to address the commonly observed suboptimal query performance and user experience in the field of video retrieval. This strategy primarily involves analyzing user behavioral data during the video retrieval process to expand query keywords, enhancing their relevance and diversity, thus optimizing search results. We achieved this by augmenting the original dataset to generate simulated user behavioral data and Ground Truth data. Subsequently, an automated query expansion algorithm effectively applied this data to video retrieval. Through experimental assessment on the video retrieval dataset (MSR- VTT), we validate the effectiveness of this method. The results demonstrate that this user behavior- driven query expansion approach significantly improves the accuracy of video retrieval and user satisfaction.",
              "article_number": "10456494"
            },
            {
              "title": "A Hybrid Semantic Statistical Query Expansion for Arabic Information Retrieval Systems",
              "abstract": "Query-document vocabulary mismatch, the lack of query expressiveness for user needs and the phenomenon of short queries are the main issues associated with information retrieval systems. Query Expansion (QE) is one of the well-known alternative for overcoming these problems. It mainly involves finding synonyms or related words for the query terms. There are several approaches in the query expansion field such as statistical and semantic approaches; they focus on expanding the individual query terms rather than the entire query during the expansion process. An other category of approaches deals with the whole query by using a neural approach based on Pseudo Relevance feedback (PRF) documents. In this work, we carried out an ablation study to measure the impact of the classical and semantic (word embedding, order, context) based query expansion on the retrieval performance. The experiments conducted on the Arabic EveTAR dataset reveal that our hybrid proposed approach combining classical (PRF) and transformer (AraBERT) is competitive with the state-of-the-art methods. In fact, the obtained result in terms of the Mean Average Precision (MAP) is up to 0.72.",
              "article_number": "9993572"
            },
            {
              "title": "New paradigm to keyword search: A survey",
              "abstract": "The total information available on WWW (World Wide Web) is huge and is increasing at lightning speed. Existing web is dominated by Search Engines which are running on keyword based search system which in turn leads to wastage of end user's precious time if he do not know the key terms which are utilized to index preferred correct pages. For example, a user enters the term ‘Jaguar’. Now current search engines will display results for ‘Car Jaguar’, ‘Cat Jaguar’ and ‘Operating System Jaguar’. That means it is the overhead on the user to go through the contents of the web pages to get the desired information. The same problem is with image search engines. If query is searched for images of ‘Tourist places in India’, image result set will return number of irrelevant as well relevant images. To solve this problem solution is required where machine will itself separate the result into relevant and irrelevant one and then presenting the relevant ones to the user and Semantic Web is a step towards that. It is web 3.0, an expansion of the current web, web 2.0 , that permits the meaning of information to be specifically described which can be well understood by computer as well as user. Ontology is very important ingredient of Semantic Web. Advantage of using Semantic Web is that it improves the usability & performance of search engine and thereby increases Precision and Recall rate of search engine. This paper tries to identify the major challenges for today's keyword search engines to handle the fast growth of web and support comprehensive user demands in quick time. Then it surveys different search techniques proposed, developed or implemented by researchers.",
              "article_number": "7380594"
            },
            {
              "title": "Document Retrieval Using Deep Learning",
              "abstract": "Document Retrieval has seen significant advancements in the last few decades. Latest developments in Natural Language Processing have made it possible to incorporate context and complex lexical patterns to document representations. This opens new possibilities for developing advanced retrieval systems. Traditional approaches for indexing documents suggest averaging word and sentence encoding to form fixed-length document embeddings. However, the common bag-of-word approach fails to incorporate the semantic context, which can be critical for understanding document-query relevancy. We address this by leveraging Bidirectional Encoder Representations from Transformers (BERT) to create semantically rich document embeddings. BERT compensates the limitations of the Term Frequency Inverse Document Frequency (TF-IDF) by incorporating contextual embeddings. In this paper, we propose an ensemble of BERT and TF-IDF for a document retrieval system, where TFIDF and BERT together score the documents against a query, to retrieve a final set of top K documents. We critically compare our model against the standard TF-IDF method and demonstrate a significant performance improvement on MS MARCO data (Microsoft-curated data of Bing queries).",
              "article_number": "9106632"
            },
            {
              "title": "Combined techniques based query expansion approach for document retrieval system",
              "abstract": "Automatic query expansion technique is used generally to resolve term mismatch problems existing in Information Retrieval System (IRS). This paper explores the necessary conditions to obtain the best query using knowledge sources and other IRS parameters. This paper proposes a new combined techniques based query expansion approach to enrich the performance of documents retrieval process. In this work, all the experiments are performed on two English written datasets CACM and CISI. At last, the proposed is tested and compared with recently developed similar types of query expansion techniques on the datasets, as mentioned above. The obtained results show a significant improvement in the performance of query expansion.",
              "article_number": "9055709"
            },
            {
              "title": "A novel approach to personalize web search through user profiling and query reformulation",
              "abstract": "With a inundating of information in WWW (World Wide Web) users are often failed to retrieve search result in context of their interest through existing search engines. So the personalization of web search result has to be carryout that process user's query and re-rank retrieved results based on their interest. User have diverse background on same query, it is very difficult for some informative query to identify user's current intention. In this paper, a novel approach is proposed that personalize web search result through query reformulation and user profiling. First, a framework is proposed that identify relevant search term for particular user from previous search history by analysing web log file maintained in the server. These terms are appended to user's ambiguous query. Second, the proposed approach proceeds the user's search result and re-rank the retrieved result by identifying interest value of user on retrieved links. Proposed new approach also identify user interest on retrieved links by combing the user interest value generated from VSM (Vector Space Model) and actual rank of that link. Third, the framework also suggest some keywords that help to incorporate user's current interest. Finally, experimental result shows the effectiveness of proposed search engine with commercial search engine with different criteria.",
              "article_number": "6954221"
            },
            {
              "title": "Spoken Document Retrieval Leveraging Bert-Based Modeling and Query Reformulation",
              "abstract": "Spoken document retrieval (SDR) has long been deemed a fundamental and important step towards efficient organization of, and access to multimedia associated with spoken content. In this paper, we present a novel study of SDR leveraging the Bidirectional Encoder Representations from Transformers (BERT) model for query and document representations (embeddings), as well as for relevance scoring. BERT has produced extremely promising results for various tasks in natural language understanding, but relatively little research on it is devoted to text information retrieval (IR), let alone SDR. We further tackle one of the critical problems facing SDR, viz. a query is often too short to convey a user's information need, via the process of pseudo-relevance feedback (PRF), showing how information cues induced from PRF can be aptly incorporated into BERT for query expansion. In addition, such query reformulation through PRF also works in conjunction with additional augmentation of lexical features and confidence scores into the document embeddings learned from BERT. The merits of our approach are attested through extensive sets of experiments, which compare it with several classic and cutting-edge (deep learning-based) retrieval approaches.",
              "article_number": "9052910"
            }
          ]
    }
]